dotfiles/emacs-old/.config/oldmacs.d/Emacs.org
#+title: Emacs config
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el
#+startup: content
#+auto_tangle: t

* Table of Contents :TOC:
- [[#intro][Intro]]
- [[#notes-to-self][Notes to self]]
  - [[#useful-keybinds][Useful Keybinds]]
  - [[#configuration-notes][Configuration notes]]
  - [[#researchtodo][Research/TODO]]
- [[#startup-performance][startup performance]]
- [[#native-compilation][Native compilation]]
- [[#identify-operating-system][identify operating system]]
- [[#package-management][Package management]]
  - [[#old-method-packageel-and-use-package-disabled][Old method (package.el and use-package) (disabled)]]
  - [[#straightel][straight.el]]
  - [[#setupel][setup.el]]
- [[#prevent-littering][prevent littering]]
  - [[#custom-settings-file][custom settings file]]
- [[#update-load-path][update load-path]]
- [[#server-mode][server-mode]]
- [[#desktop-environment][desktop environment]]
- [[#special-variables][Special variables]]
- [[#basics][basics]]
  - [[#basic-tweaks][basic tweaks]]
  - [[#disable-bell][disable bell]]
  - [[#line-numbers][line numbers]]
  - [[#fonts--org-fonts][fonts + org-fonts]]
  - [[#fontaine][fontaine]]
  - [[#improved-scrolling][improved scrolling]]
  - [[#transparency][transparency]]
  - [[#shorten-y-n-prompt][shorten y-n prompt]]
  - [[#replace-gui-popup-menus][replace GUI popup menus]]
  - [[#all-the-icons][all-the-icons]]
  - [[#nerd-fonts][nerd-fonts]]
- [[#basic-functionality][basic functionality]]
  - [[#misc-configuration-tools][misc configuration tools]]
  - [[#auto-update-packages-disabled][auto-update packages (disabled)]]
  - [[#load-custom-functions][load custom functions]]
  - [[#auto-revert-changed-files][auto-revert changed files]]
- [[#keybindings][keybindings]]
  - [[#make-escape-quit][make escape quit]]
  - [[#meow][meow]]
  - [[#god-mode-disabled][god-mode (disabled)]]
  - [[#todo-evil-mode][TODO: evil-mode]]
  - [[#todo-undo-treefu-disabled][TODO: undo-tree/fu (disabled)]]
  - [[#generalel][general.el]]
  - [[#generalel-generic-binds][general.el generic binds]]
  - [[#hydra][hydra]]
  - [[#todo-crux-where-to-put][TODO: crux [where to put?]]]
  - [[#todo-expand-region][TODO?: expand region]]
  - [[#avy][avy]]
  - [[#save-position-in-buffer][save position in buffer]]
  - [[#todo-cheatsheet][TODO?: cheatsheet]]
  - [[#todo-free-keys][TODO: free-keys]]
  - [[#custom-keybinds][custom keybinds]]
  - [[#todo-make-c-j-do-with-c-m][TODO?: Make C-j do with C-m]]
  - [[#window-management][window management]]
  - [[#buffer-management][buffer management]]
  - [[#key-quiz][Key quiz!!!]]
- [[#magit][Magit]]
- [[#ui-configuration][UI Configuration]]
  - [[#todo2-ivy--counsel][TODO/2: ivy + counsel]]
  - [[#todo-themes][TODO: themes]]
  - [[#diminish][diminish]]
  - [[#doom-modeline][doom-modeline]]
  - [[#mini-modeline][mini-modeline]]
  - [[#rainbow-delimiters][rainbow-delimiters]]
  - [[#bionic-reading][bionic reading]]
  - [[#modus-themes][modus-themes]]
  - [[#which-key][which-key]]
  - [[#auto-balance-windows-disabled][auto balance windows (disabled)]]
  - [[#helpful][helpful]]
  - [[#todo-info][TODO: Info]]
  - [[#todo-perspectiveel-disabled][TODO?: perspective.el (disabled)]]
  - [[#popper-empty][popper (empty)]]
  - [[#todo-darkroom][TODO?: darkroom]]
- [[#decorative][Decorative]]
  - [[#dashboard][dashboard]]
  - [[#fireplace][fireplace]]
- [[#other][Other]]
  - [[#todo-discover-my-major][TODO?: discover-my-major]]
  - [[#todo-calculator][TODO: calculator]]
- [[#system-management][System management]]
  - [[#guix-management][guix management]]
  - [[#todo-networkmanager][TODO??: NetworkManager]]
  - [[#todo-stumpwm-sly][TODO: StumpWM Sly]]
  - [[#todo-stumpwm-mode][TODO: StumpWM-mode]]
- [[#all-org][ALL: Org]]
  - [[#org-main-config][Org main config]]
  - [[#org-customizations][Org-customizations]]
  - [[#org-fonts-funcall][Org-fonts (funcall)]]
  - [[#import-ri-workflow][import ri-workflow]]
  - [[#bullets][Bullets]]
  - [[#org-extra-emphasis][Org-extra-emphasis]]
  - [[#side-padding][side-padding]]
  - [[#org-babel][org-babel]]
  - [[#toc][TOC]]
  - [[#todo-org-roam][TODO: org-roam]]
  - [[#latex][LaTeX]]
  - [[#typographic-symbols-problematic][Typographic symbols (problematic?)]]
  - [[#ledger-mode][ledger-mode]]
  - [[#color-picker][Color picker]]
  - [[#pomodoro-timer][Pomodoro timer]]
  - [[#org-download][Org-Download]]
  - [[#todo-markdown][TODO: Markdown]]
- [[#all-development][ALL: Development]]
  - [[#language-servers][language servers]]
  - [[#languages][languages]]
  - [[#company-mode][Company mode]]
  - [[#yasnippet][YASnippet]]
  - [[#flycheck][Flycheck]]
  - [[#dap-mode][dap-mode]]
  - [[#projectile][Projectile]]
  - [[#compilation][compilation]]
  - [[#todoauto-indentation][TODO?:auto-indentation]]
  - [[#smart-parens][smart-parens]]
  - [[#commenting][commenting]]
  - [[#prettify-lambdas][prettify lambdas]]
  - [[#crdtel-collaborative-editing][crdt.el (Collaborative Editing)]]
  - [[#pinentry][pinentry]]
- [[#terminal][Terminal]]
  - [[#term-mode][term-mode]]
  - [[#vterm][vterm]]
  - [[#shell-mode][shell-mode]]
  - [[#todo-eshell][TODO: Eshell]]
  - [[#shell-pop-disabled][shell-pop (disabled)]]
  - [[#multi-term-disabled][multi-term (disabled)]]
  - [[#todo-multi-vterm][TODO: multi-vterm]]
  - [[#leader-keys][leader-keys]]
- [[#files][Files]]
  - [[#todo-dired-copy-table-and-hide-dotfiles][TODO: Dired (copy table and hide dotfiles)]]
  - [[#dirvish][dirvish]]
  - [[#todo-open-files-externally-doesnt-work-with-dirvish][TODO: open files externally (doesn't work with dirvish)]]
  - [[#tramp][TRAMP]]
  - [[#sudo-edit][sudo-edit]]
  - [[#dired-toggle-sudo][dired-toggle-sudo]]
- [[#programs][Programs]]
  - [[#elfeed][elfeed]]
  - [[#browser][Browser]]
  - [[#gnus][gnus]]
  - [[#mu4e][mu4e]]
  - [[#ement][ement]]
  - [[#emacs-jabber][emacs-jabber]]
  - [[#erc][erc]]
  - [[#mastodonel][mastodon.el]]
- [[#dvorak-swap-x-and-u][DVORAK swap x and u]]
- [[#runtime-performance][Runtime performance]]
- [[#emacs-profile][Emacs profile]]

* Intro

Emacs config!

* Notes to self

Personal notes (useful keybinds, packages to explore, etc...):

** Useful Keybinds

  + C-x C-e to eval at point
  + M-: to eval variable
  + M-o in list for options
  + C-w window management
  + evil C-o to go back to prev location!
  + check-parens to check for errors
  + emacs-lisp-mode-map for viewing local keybinds
  + org-lint to debug
  + C-c C-SPC to jump to previous location
    + actually C-c & for some reason...
  + M-r to center cursor
  + C-x r SPC <key> to save point to registor
    + C-x r j <key> to jump to registor
  + C-c TAB to close current heading
  + C-c ' to edit code block in separate buffer
  + M-i to insert ivy selection at point
  + C-M-d to insert ivy minibuffer selection at point
  + C-c C-k outline show branches
    + C-u C-f C-b C-n C-p
  + you can select the buffer name on bar to show menu... very useful!
  + C-h i to show manuals for all applications, like gnus.
  + C-M-SPC to mark sexp by spaces/sexp.
  + C-c C-v d to org-babel-demarcate-block (break code block to add comments (very useful!!!!)
  + straight-remove-unused-repos for removing unused repos.
  + C-M-/ for lisp completion.
  + j in meow mode for select space between beginning of line to end of previous.
  + t in meow mode to go to char and select all text.
  + f in meow mode to jump to next instance of char.
  + C-u ( and C-u ) and <f4> to use kmacros.
  + C-h o for symbol help menu.
  + z in meow mode for undo ANY selection command!
  + G in meow mode to select multiple lines and edit.
  + r in meow mode to replace selection with yank-buffer.
  + C-h m to describe-mode.
  + C-h E to describe-keymap.

C-i is empty
https://www.masteringemacs.org/article/mastering-key-bindings-emacs

** Configuration notes

Reduce Emacs startup time with use-package:
- :hook
- :bind
- :commands
- :mode
- :after
- :defer

Use-package all keywords:
- :ensure - Install package
- :after - Load after another package
- :init - Run code before package loads
- :config - Run code after package loads
- :custom - Set custom variables with concise syntax
- :defer - Defer loading until some later point
- :demand - Ensure loading at startup
- :bind - Bind keys for modes
- :hook - Set hooks that will cause package to load
- :commands - Set autoloaded commands that will cause packag to load
- :mode - Activate mode when particular file types are opened

reset keymap keybinds:
: (setq dired-mode-map (make-keymap))

unbind key:
: (define-key reftex-mode-map (kbd "C-t") nil)

eval after package loaded:
: with-eval-after-load

structure template options:
- :mkdirp :: create dirs when tangling (better disabled imo).

** Research/TODO
*** emacs config todo's

+ Awesome Emacs packages:
   https://github.com/emacs-tw/awesome-emacs#windows
+ ace-window
  https://github.com/abo-abo/ace-window
+ switch-window
  https://github.com/dimitri/switch-window
+ rcirc
+ discover-my-major
+ discover.el
+ speed-type
+ emacs-fireplace
+ edwina (tiling wm)
https://codeberg.org/daviwil/dotfiles/src/branch/master/Emacs.org
+ lem.el (lemmy) [[https://codeberg.org/martianh/lem.el][link]]

fix eglot c mode spacing

Poetry and journaling buffer and system...
one general input, then sent over to different categories...
would be nice on android termux too...

the ideal minibuffer: just the modeline with space for buffer minibuffer to the left of battery sign, like a block.

pdf viewer? latex?

gnu guix config?

(sync music with syncthing? must remove lots of spotify downloads tho...)

watch org mode config videos to set up quick, instant notes from anywhere, and org-journal.

search only for headlines... can achieve with TOC maybe? take inpiro from system crafters vid?

bind a function key to disable the _touchpad_.

using general.el to define keys doesn't show prefix names using meow leader. use define-prefix or something instead?

!!!~/Projects/
~/Projects/code
~/Projects/git-cloned

- make own _tray icon_ for various things like:
  + https://fosspost.org/custom-system-tray-icon-indicator-linux/
  + option to 'emerge --sync' and show number of packages to update.
  + volume percent show (possible in an icon?? (only image or text ok too?))
  + /sync packages once every two days/ and show number in tray.

create a _voice training roadmap_ org file
- might also be really good for learning org mode.
  - Specifically org-roam!!
    - Web together voice training ideas and researched information on technicalities of voice.!

_ical org-mode converter!_ improvements... everything overlaps... find a reliable program to convert ics file to org mode (just download and run the pythod script?)
- There /has/ to be a elisp script (or at least scheme) to convert ical to org-mode...
- the main benefit of ical org instead of ical diary is being able to create custom agenda views dedicated to ics org files!

make my own mobile emoticon keyboard? would be a fun project to learn about android development

rewatch that _no boilerplate_ video and put that into an org roam document, since i dont know where to put that information.

_lispyville_ for jumping through sexp's and make lisp editing just a more comfy experience (at least do it before rewriting everything with setup.el!!

fix _gentoo hibernation_!

setup perspective.el for easier window management!

switch from ivy+counsel to vertigo+consult? So that i can preview themes?

consider easier _font_ management:
https://github.com/protesilaos/fontaine

make it so i can use this emacs config on _termux_, so can do accounting and stuff.

enable show stars in org-mode

customize startup screen emacs

_journaling every day_? outlet, also good for japan?

control audio with keys (mpd?)

consider removing M-- universal-argument, make it the same as C--, negative arugment.

use popper to specifically hide cargo-run while in lsp major mode, so can hide with keybind easily (maybe doesn't beat the current model...)

shell-pop and hook, auto window balancing... maybe it's better to use popper and make my own custom pop-up terminal.

_spell-check_ on certain buffers (if :property writing is enabled (create custom properties?))

set up and learn _org latex_ !! for college math and classes

find stickers i want and let chris know

git clone daviwil's repo from codeberg.

get through all the open tabs (financing, etc)

leave a comment on stack overflow with the person saying ~advice~ is good for auto-balance.

make auto-balance-windows only balance in the direction that it's splitting in (e.g, vertically)

build custom guix overlay, inherit standard emacs, but with the alpha-transparency patch applied.

key-translate-map to bind "s-$" to "s-0" ?

write a function to do a =emacs-lisp-macroexpand= in the furthest-out sexp, or the sexp with a macro right after it.

work on guix:
- update config with all the manifests and see if i can get straight.el to work with setup.el
- copy daviwil's system config.
  - need to install feh (through user manifest? system manifest?)

fix desktop keybinds list back to old original

just move all the org deadline stuff into the org dir. maybe temporarily abort plan to have all specific major mode keybinds in one place? if come back to the plan, use "n" key?

org-agenda fix and improve

read through and work on the Workflow.org file, so that i can make sense of it all and begin diving deep into the productivity features of emacs, tying everything together and using it on a regular day to day basis, deeply intertwined in a safe and comfy environment.

pipewire:
https://codeberg.org/SystemCrafters/crafted-guix

make headlines in org variable-font

org new line heading with default spacing

- [-] things to set up on this system
  - [X] firejail or flatseal isolation (native integration with .desktop files? possible with nix?)
    - [X] zoom container?
  - [X] kdeconnect
  - [X] sandboxed arkenfox with keepassxc integration
  - [ ] set up regular pass
  - [ ] kvm virtual machine
  - [X] disable kernel modules script in real time.
  - [X] syncthing
  - [ ] pipewire (copy gentoo pipewire launcher or use someone's service script)
  - [X] script to unload kernel module to disable camera/mic
  - [X] fully recreate the setup over on here so can distrohop before move-in (20 days)
  - [X] buy laptop charger, ethernet, power strip

create new org bullet type: colon.

org-outdent and similar in =C-c n= instead of =C-c m=, or bind to =C-c o o h/t/n/s= (best option)

seems pretty cool
https://github.com/alhassy/org-special-block-extras/tree/d7bdf9fcfe28f96f9470719f3985a6e413592de8

create =C-c o o m= to access next, prev, same next/prev, back cursor. or some keybind like that, which is connected to a hydra thingy.

Question to ask:
Hello!
I have a question regarding the variable lsp-idle-delay.
Is it possible to have different values of ~lsp-idle-delay~ for different languages/modes? I would like to set it to 0.1 when writing C code and 0.6 for Rust.
The best solution I can come up with is to add, for example, ~(setq lsp-idle-delay 0.1)~ to ~c-mode-hook~ and ~(setq lsp-idle-delay 0.6)~ in ~rustic-mode-hook~. It's not the cleanest solution, so I'm wondering if there's a better way to implement this. Any ideas?

experiment with C-Ret

make C-M-Ret work on both lists and heading (actually maybe not...)

implement switching between lsp-mode and eglot.

change hidden list indents before into star char, and make it invisible, so list-sublist indentation is better.

project idea: elisp program that converts files or processes to sound, like aplay, to create noise music.

disable installing emacs packages through guix, cause often breaks.

create new google account.


rev:  p7zip, ghidra, ggc

+ complete stumpwm so i can start hearth and docs for hearth.

**** Things to check out
