dotfiles/emacs-old/.config/oldmacs.d/Emacs.org
***** Prog lang learn
- elixir documentation? rust documentation explore and write cool things with cool functions i find in it?
- read through zahlee's documentation
- Rust -> hearth project, review documentation and issues, learn rust code, package for guix.
- Begin exploring webrings, small niche space on internet, kurzgecarzt vid, find my space on the internet!
- Rewrite Emacs config in a module format!!! https://codeberg.org/daviwil/dotfiles/src/branch/guix-home/.emacs.d/init.el
- identify battery usage of applications to optimize battery life.
- low battery mode?
- install VCV Rack through Nix
**** Things to do
***** Project
- [ ] Make rust grep tutorial.
- [ ] Make Conway's game of life in Rust
- lispiest OS
- Make my own lisp
  [[https://www.buildyourownlisp.com/contents][link to website]]
  relatively short, fun little project.
- install QubesOS on thinkpad laptop.
- Try to get all shit done (psych SOMA serveys, etc), so can hang out with Roux maybe this weekend...
- OWN LISP in C!!! bc falling behind in the C class!
- work on projects that will increase my ability to feel (can only explore art when boymode). need radical escapism to experience freedom.
- rewrite custom kernel patcher in lisp, and use on thinkpad?
- read through hearth code (https://github.com/hearth-rs/hearth)
- write very light firejail profile for renoise!
- [ ] [][][][] SETUP FOR WATCHING LAIN (I NEED TO WATCH LAIN)
- Change dotfiles repo to something more interesting, and make it my Guix repo (channel: home, packages, system)
- xmodmap bind print key to caps lock for renoise
***** Emacs
- [ ] lsp-mode setup
- [ ] org-mode
  - essay writing environment
    - word correction/suggestions
  - change image metadata after downloading with org-download (e.g. yr 2000).
  - _change "-" to <dot> in org-mode_
- [ ] gnus newsgroup
- [ ] matrix client
- [ ] EXWM
  - bspwm bspc keybind thing to kill emacs when it freezes.
- [ ] Universal Argument -> C-M-RET -> if in list, ret new list and indent.
- [ ] Universal Argument -> C-g (exit insert) -> additional save file command.
- [ ] org pomodoro ping noise
- [ ] in this list of modes, disable meow SPC bar. create universal toggle as keybind. (gnus-summary-mode-map, gnus-article-mode-map, info)
- [ ] dired-isearch-filenames-regexp but with ivy-search, custom function?
- [ ] implement crux-smart-open-line to newline without breaking.
- [ ] lsp c/rust: on some occasional lsp-update hook (e.g. yad-completion?, etc), check/set lsp completion interval variable, with optimal, fastest functions/operations.
- [ ] code folding, since i don't like org-mode code blocks... not as interactive or hands-on... something that isn't dependent on emacs-org per say? [[https://github.com/gregsexton/origami.el][origami.el - gh repo link]]
- [ ] If pass universal argument to C-g, save after exiting meow-insert-mode!.
- [ ] org-agenda Workflow clean something every day.
- [ ] Over-estimate tasks, positive first thing, with 100% success rate.
- [ ] Better org-mode for writing: [[https://github.com/rnkn/olivetti]] (writeroom-mode for wide, distraction-free.
- [ ] org-mode is a rabbit-hole... start watching yt vids on org?
- annotate pdf's (for academics, actually really op, like for CS class holy shit wtf??? this is op) [[https://github.com/org-noter/org-noter]].
- [ ] study gnus https://www.emacswiki.org/emacs/GnusTutorial#h5o-12
  - account on eternal-september: https://www.eternal-september.org/RegisterNewsAccount.php?language=en
- [ ] Fix org code-block zoom fixed pitch, by referring to distrotube video.
- [ ] Try to set up org with no visual-fill-column-mode, bc better for school notes indentation? refer to derek taylor config
- [ ] update everything to setup.el (https://codeberg.org/daviwil/dotfiles/src/branch/master/Emacs.org)
- [ ] Avy jump w/ ~C-M-] ]~ ?
- [ ] https://github.com/james-stoup/emacs-org-mode-tutorial (VERY GOOD)
- [ ] TODO: elisp comments auto-wrap at 80 chars!!!!!!!!!!!!!
- [ ] package where when enabled, every command run when pressing a keybind will show (debug w/ lsp C-g not working glitch thing).
- [ ][][][] possible fix for LSP teleportation bug: separate buffer, different cursor location. meow-insert at other location.
- [ ] I actually prefer no visual-fill-column-mode, or maybe i can up it to only a liiiiitle bit, it might help with notetaking and shih; enable only if personal dots?
***** Stumpwm
- [ ] new emacs window in every workspace by default, easy access to spawn new and delete windows. if emacs is default startup menu when try to open a new application, delete window so not preoccupied. create keybind to split window and spawn a new emacs window, either above/below or to the side. maybe bind S-c to create a new emacs window, either to the right or below, smartly, with some calculations, to get quick and easy access to emacs buffer for C-h v or similar commands very quickly, like while using a web browser.
- [ ] Maybe have an emacs window open at all times in each workspace and closing it will simply hide it? actually emacsclient should make that negligible with no startup times...
- [ ] stumpwm s-/ : hydra arrow keys to skip song or like song , toggle media source? show dunst notif to show current when going through...
- [ ] stumpwm C-z C-n to toggle recent notifications?
- [ ] when switch to another X-window, if window is a steam window, switch to qwerty. if else, if not dvorak, switch to dvorak.
- [ ] optimize doc-view mode emacs (just as safe as mu-pdf).
- [ ] instead of binding C-q to pass through C-z inputs, just bind s-z to send a signal for C-z.
- [ ] C-z h bind to exit company/meow-selection/insert-mode (all in one function), from both emacs and stumpwm.
- [ ] create bind to launch emacsclient with arg multi-vterm?. (to get unified themes optionally.)
- [ ] in on non-emacs window, bind M-o to go to other window.
  - use similar techinque of performing emacs keybinds if not on an emacs window.
- [ ] set module-dir to nil and create a function ri/load-module that searches and loads module from the dir, as well as the ...common-lisp/sbcl/ dir.
- [ ] open term below
- [ ] work on executable scripts (https://config.phundrak.com/bin.html)
- [ ] create a command where upon running, it takes the clipboard, puts it into a tmp file, and uses the text to speech program to read it out loud. might be easiest to write it as a shell script!
- [ ] install sound module, show current volume in thing.
- [ ] Scratchpad module:
  - https://github.com/podiki/scratchpad/blob/master/scratchpad.lisp
  - https://github.com/herbertjones/my-stumpwm-config/blob/master/scratchpad.lisp
***** Linux
- tmux
- set up auto brightness control (since there is a sensor...)
- tray icon, camera kernel module (optimize w/ command to ret if loaded or not loaded), click to toggle.
- set up touchpad toggle and bind to <XF86TouchpadToggle>
- create previous window only this frame
- set up an easy firewall for security on public network (is it necessary? perks of having one??)
- learn guix-shell for python environment and working environment with loadable guile env file
- https://guix.gnu.org/manual/en/manual/devel/en/html_node/Invoking-guix-shell.html
- Steam: use gameoverlay with flatpak, if not, install as a Guix package.
- create statusbar icon/output for general security stuff. ~[ num | Letter codes ]~
add to warnings if vpn is off, or bluetooth is on, or etc. or if multiple connections active, or if any mic devices are enabled (internal, external), webcam, p2p, etc.
**** etc notes
***** cybersec
- Overthewire bandit:
  answers: https://thor-sec.com/walkthroughs/otw_bandit/
  current: https://overthewire.org/wargames/bandit/bandit16.html
  useful cli commands cheatsheat:
  ~ps~ processes
  ~head~ first 10 processes (-n #)
  ~xargs kill~ append stdout as params to command
  ~help~ instead of ~man~.
  ~du~ space usage.
  ~file ./*~ type of file.
  ~find . -readable -size 1033c~
  ~find / -size 33c -user bandit7 -group bandit6 2> /dev/null~
  =watch mental outlaw video on shell commands=
  =work on bandit overthewire=
  
  thingy --v
  8  TESKZC0XvTetK0S9xNwm25STk5iWrBvP
  9  EN632PlfYiZbn3PhVK3XOGSlNInNE00t
  10  G7w8LIi6J3kTb8A7j9LgrywtEUlyyp6s
  11  6zPeziLdR2RKNdNYFNb6nVCKzphlXHBM
  12  JVNBBFSmZwKKOP0XbFXOoW8chDz5yVRv
  13  wbWdlBxEir4CaE8LaPhauuOo6pwRmrDw
  14  fGrHPx402xGC7U7rXKDaxiWFTOiF0ENq
  15  jN2kgmIXJ6fShzhT2avhotn4Zcka6tnt
  
* startup performance

Increase startup performance of Emacs by lowering the =gc-cons-threshold= variable, which reduces the frequency of garbage collection.

A hook is used to print the startup time of Emacs.

#+begin_src emacs-lisp

  ;; -*- lexical-binding: t; -*-

  ;; The default is 800 kilobytes (measured in bytes)
  (setq gc-cons-threshold (* 50 1000 1000))

  (defun ri/display-startup-time ()
    (message "Emacs loaded in %s with %d garbage collections."
             (format "%.2f seconds"
                     (float-time
                      (time-subtract after-init-time before-init-time)))
             gcs-done))

  (add-hook 'emacs-startup-hook #'ri/display-startup-time)

  ;; after emacs is loaded
  (add-hook 'after-init-hook (lambda ()
                               ;; Make gc pauses faster by decreasing the threshold.
                               (setq gc-cons-threshold (* 2 1000 1000))))

#+end_src

* Native compilation

Disable compiler warnings when compiling packages.

The =eln-cache/= path in the =user-emacs-directory= should be in the =native-comp-eln-load-path= already, but if not, uncomment the second expression.

#+begin_src emacs-lisp

  ;; native comp
  (setq native-comp-async-report-warnings-errors 'nil)

  ;; Set the right directory to store the native comp cache (already enabled?)
  ;; (add-to-list 'native-comp-eln-load-path (expand-file-name "eln-cache/" user-emacs-directory))

#+end_src

* identify operating system

Identify the system Emacs is running on.

TODO: there is currently no viable way to determine whether the system is running on Guix System or not, so =ri/is-guix-system= will always eval nil for now.

TODO: implement a better way to determine =ri/is-thinkpad= than looking at the hostname.

#+begin_src emacs-lisp

  ;; (require 'subr-x) ; TEST if necessary
  (setq ri/is-termux
        (string-suffix-p "Android" (string-trim (shell-command-to-string "uname -a"))))

  (setq ri/is-thinkpad (and (eq system-type 'gnu/linux)
                            (equal (system-name) "thinkpad1")))

  ;; use shell-command w/ grep to find "Guix System" in /etc/*release
  (setq ri/is-guix-system (and (eq system-type 'gnu/linux)
  			     (or (equal (system-name) "GNUwU")
  				 (equal (system-name) "gnuwu"))))

  (setq ri/has-guix-installed (and (eq system-type 'gnu/linux)
                                   (executable-find "guix")))

  ;; (require 'f)
  ;; (string-equal (f-read "/etc/issue")
  ;; "\nThis is the GNU system.  Welcome.\n")))

#+end_src

* Package management

Package management on Emacs. Includes =package.el=, =straight.el=, =use-package=, =setup.el=, etc.

** Old method (package.el and use-package) (disabled)

This is the old method for package management. It is disabled (prevented from tangling to =init.el=), but it's still left here for reference.

*** package.el

*Disabled tangling in favor of =straight.el=.*

Loads package.el, adds the repositories to fetch from, initializes the package system, refresh the package list if on a fresh install (I think).

#+begin_src emacs-lisp :tangle no

  ;; Package sources ----
  (require 'package) ; package management functions (autoloaded?)
  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
                           ("org" . "https://orgmode.org/elpa/")
                           ("elpa" . "https://elpa.gnu.org/packages/")))
  (package-initialize) ; initialize package system and prep to be used

  ;; if package-archive-contents is empty (fresh install), ----
  ;;   run package-refresh-contents.
  (unless package-archive-contents
    (package-refresh-contents))

#+end_src

*** use-package (with package.el)

*Disabled tangling in favor of =straight.el=.*

After setting up =package.el=, if use-package is not installed, install it. Then, load =use-package=, then set a few settings.

#+begin_src emacs-lisp :tangle no

  ;; non-Linux setup use-package ----
  ;; if use-package isn't installed or new update, then package-install it
  (unless (package-installed-p 'use-package)
    (package-install 'use-package))

  ;; setup use-package ----
  (require 'use-package)
  (setq use-package-always-ensure t) ; no need to add :ensure t on every package that needs it
  ;; (setq use-package-always-defer t) ; explicitly state which packages to load
  (setq use-package-verbose t) ; more verbose output

#+end_src

