dotfiles/emacs-old/.config/oldmacs.d/init.el
;; -*- lexical-binding: t; -*-

;; The default is 800 kilobytes (measured in bytes)
(setq gc-cons-threshold (* 50 1000 1000))

(defun ri/display-startup-time ()
  (message "Emacs loaded in %s with %d garbage collections."
           (format "%.2f seconds"
                   (float-time
                    (time-subtract after-init-time before-init-time)))
           gcs-done))

(add-hook 'emacs-startup-hook #'ri/display-startup-time)

;; after emacs is loaded
(add-hook 'after-init-hook (lambda ()
                             ;; Make gc pauses faster by decreasing the threshold.
                             (setq gc-cons-threshold (* 2 1000 1000))))

;; native comp
(setq native-comp-async-report-warnings-errors 'nil)

;; Set the right directory to store the native comp cache (already enabled?)
;; (add-to-list 'native-comp-eln-load-path (expand-file-name "eln-cache/" user-emacs-directory))

;; (require 'subr-x) ; TEST if necessary
(setq ri/is-termux
      (string-suffix-p "Android" (string-trim (shell-command-to-string "uname -a"))))

(setq ri/is-thinkpad (and (eq system-type 'gnu/linux)
                          (equal (system-name) "thinkpad1")))

;; use shell-command w/ grep to find "Guix System" in /etc/*release
(setq ri/is-guix-system (and (eq system-type 'gnu/linux)
  			   (or (equal (system-name) "GNUwU")
  			       (equal (system-name) "gnuwu"))))

(setq ri/has-guix-installed (and (eq system-type 'gnu/linux)
                                 (executable-find "guix")))

;; (require 'f)
;; (string-equal (f-read "/etc/issue")
;; "\nThis is the GNU system.  Welcome.\n")))
