dotfiles/emacs-old/.config/oldmacs.d/Emacs.org
** straight.el

[[https://github.crookster.org/switching-to-straight.el-from-emacs-26-builtin-package.el/][Blog - Switching from use-package to straight.el]]

Solves the issue with custom-set-variables and package-selected-packages, and gives you a deeper understanding of the packages installed.

Notes:
- To delete old, unused repos, use ~straight-remove-unused-repos~.

#+begin_src emacs-lisp

  (unless (featurep 'straight)
    (defvar bootstrap-version)
    (let ((bootstrap-file
           (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
          (bootstrap-version 6))
      (unless (file-exists-p bootstrap-file)
        (with-current-buffer
            (url-retrieve-synchronously
             "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
             'silent 'inhibit-cookies)
          (goto-char (point-max))
          (eval-print-last-sexp)))
      (load bootstrap-file nil 'nomessage)))

  (straight-use-package 'use-package) ; use-package calls will be sent to use-package
  (setq straight-use-package-by-default t) ; no need to put :straight

  ;; Load the helper package for commands like `straight-x-clean-unused-repos'
  (require 'straight-x)

#+end_src

*** minimal package.el config

Load package.el with a minimal config, so that you can search for and browse MELPA packages.

#+begin_src emacs-lisp :tangle no

  ;;  package.el
  ;; so package-list-packages includes them
  (require 'package)
  (add-to-list 'package-archives
               '("melpa" . "https://melpa.org/packages/"))

#+end_src

** setup.el

[[https://www.emacswiki.org/emacs/SetupEl][setup.el - Emacs Wiki]]

An alternative to use-package that is a lot prettier, has easier hook declaration syntax, and feels more like ordinary Emacs code.

Keywords to note:
- :when-loaded (basically =:config= I think) (apparently should try to avoid using...) (=require= also loads package and achieves similar functionality.)
- :load-after /package/ (load this after /package/ loads).
- :hook /mode/ : add /mode/ to current package's hook.
- :hook-into /mode/ : hook current package into /mode/'s (e.g. (visual-fill-column (:hook-into org-mode)))

The below headings add new keywords to setup.el to extend its functionality:

#+begin_src emacs-lisp

  ;; (package-install 'setup) ; no longer using package.el (using straight.el)
  (straight-use-package '(setup :type git :host nil :repo "https://git.sr.ht/~pkal/setup"))
  (require 'setup)

  ;; Uncomment this for debugging purposes
  ;; (defun dw/log-require (&rest args)
  ;;   (with-current-buffer (get-buffer-create "*require-log*")
  ;;     (insert (format "%s\n"
  ;;                     (file-name-nondirectory (car args))))))
  ;; (add-to-list 'after-load-functions #'dw/log-require)

#+end_src

*** :pkg

Keyword to manage both Guix-installed packages and straight.el packages.

The =:pkg= keyword will depend on Guix-installed Emacs packages unless the parameter seems like a straight.el recipe (it's a list).

#+begin_src emacs-lisp

  ;; Recipe is always a list
  ;; Install via Guix if length == 1 or :guix t is present

  (defvar ri/guix-emacs-packages '()
    "Contains a list of all Emacs package names that must be
  installed via Guix.")

  ;; Examples:
  ;; - (org-roam :straight t)
  ;; - (git-gutter :straight git-gutter-fringe)

  (defun ri/filter-straight-recipe (recipe)
    (let* ((plist (cdr recipe))
           (name (plist-get plist :straight)))
      (cons (if (and name (not (equal name t)))
                name
              (car recipe))
            (plist-put plist :straight nil))))

  (setup-define :pkg
    (lambda (&rest recipe)
      (if (and ri/is-guix-system	; modified, but will this break?
               nil ; DISABLE
               (or (eq (length recipe) 1)
                   (plist-get (cdr recipe) :guix)))
          ;; if ri/is-guix-system and regular input, install w/ guix.
          (progn `(add-to-list 'ri/guix-emacs-packages
                               ,(or (plist-get recipe :guix)
                                    (concat "emacs-" (symbol-name (car recipe))))))
        ;; else, install directly with straight.el
        `(straight-use-package ',(ri/filter-straight-recipe recipe))))
    :documentation "Install RECIPE via Guix or straight.el"
    :shorthand #'cadr)

#+end_src

*** :delay

Delay the loading of a package until a certain amount of idle time has passed.

#+begin_src emacs-lisp

  (setup-define :delay
    (lambda (&rest time)
      `(run-with-idle-timer ,(or time 1)
                            nil ;; Don't repeat
                            (lambda () (require ',(setup-get 'feature)))))
    :documentation "Delay loading the feature until a certain amount of idle time has passed.")

#+end_src

*** :disabled

Disable a package configuration.

#+begin_src emacs-lisp

  (setup-define :disabled
    (lambda ()
      `,(setup-quit))
    :documentation "Always stop evaluating the body.")

#+end_src

*** :load-after

This keyword causes a body to be executed after a given package loads.

E.g. ~:load-after dired-mode~. Basically the ~:after~ keyword in use-package.

#+begin_src emacs-lisp

  (setup-define :load-after
    (lambda (features &rest body)
      (let ((body `(progn
                     (require ',(setup-get 'feature))
                     ,@body)))
        (dolist (feature (if (listp features)
                             (nreverse features)
                           (list features)))
          (setq body `(with-eval-after-load ',feature ,body)))
        body))
    :documentation "Load the current feature after FEATURES."
    :indent 1)

#+end_src

* prevent littering

Prevent littering of excess files by changing the =user-emacs-directory= to the location of =init.el=, then set the =user-init-file= accordingly, then change the directory of =url-history-file= to =./url/history= (the package =no-littering= moves it to =./var/url/distory= automatically, but might as well keep it like this.

#+begin_src emacs-lisp

  ;; Change the user-emacs-directory to keep unwanted things out of ~/.emacs.d
  ;; UNNECESSARY CHANGE, CHANGE BACK!
  (setq user-emacs-directory ;; should be directory of init.el or Emacs.org
        (file-name-directory (or load-file-name (buffer-file-name))))
  (setq user-init-file ;; init.el in user-emacs-directory
        (concat user-emacs-directory "init.el"))
  (setq url-history-file (expand-file-name "url/history" user-emacs-directory))

  ;; no-littering
  (setup (:pkg no-littering)
    (require 'no-littering)) ; is the require statement really necessary?

  ;; keep autosaves in emacs dir
  (setq auto-save-file-name-transforms
        `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))

  (setq backup-directory-alist
        `(("." . ,(expand-file-name ".backup/" user-emacs-directory))))

#+end_src

*Guix packages:*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  "emacs-no-littering"

#+end_src

** custom settings file

There are two methods here to make the Emacs custom settings file a temp file:
- Method 1 creates a temp file that lives till system shutdown.
- Method 2 creates a temp file that lives till Emacs termination.

#+begin_src emacs-lisp

  ;; method 1
  ;; Keep customization settings in a temporary file (does this even work?)
  ;; (setq custom-file
  ;;       (if (boundp 'server-socket-dir)
  ;;           (expand-file-name "custom.el" server-socket-dir)
  ;;         (expand-file-name (format "emacs-custom-%s.el" (user-uid)) temporary-file-directory)))
  ;; (load custom-file t)

  ;; method 2
  (setq custom-file (make-temp-file "emacs-custom"))

#+end_src

* update load-path

Add the =./lisp= directory to the load path.

#+begin_src emacs-lisp

  ;; add user lisp files to path
  ;; (push vs add-to-list?)
  (push (concat user-emacs-directory "lisp/") load-path)

#+end_src

* server-mode

server-mode makes it so you can run =emacsclient= from a shell to edit a file through a running Emacs session.

#+begin_src emacs-lisp 

  (require 'server)
  (with-eval-after-load 'server
    ;; if an instance of emacs is not running, then start server.
    (unless (and (boundp 'server-process)
                 (processp server-process)
                 (server-running-p))
      (server-start)
      (message "Emacsclient Server started!")
      ))

#+end_src

* desktop environment

If Emacs was started with the command line argument =--start-exwm=, enable =ri/exwm-enabled=. Print an error if Emacs was built with pgtk, since EXWM needs Xorg to run.

will this code exit without showing error message if window-system is pgtk , since it will fail at the first is window-system 'x ?

#+begin_src emacs-lisp

  (setq ri/exwm-enabled
        (and (eq window-system 'x)
             ;; returns 't if process with exwm exists
             (let ((exwm-process (string-to-number
                                  (shell-command-to-string
                                   "ps aux | grep exwm | grep -vc grep")))) ;<
               (> exwm-process 0))
             ;; (string-match-p "exwm" (format "%s" command-line-args))
             ;; (seq-contains command-line-args "--start-exwm") 
             (if (eq window-system 'pgtk)
                 (progn (message "ERROR: You cant start EXWM bc Emacs was compiled with pgtk!")
                        nil)
               t)))

  (when ri/exwm-enabled
    (message "exwm-enabled!")
    (require 'ri-desktop))

#+end_src

* Special variables

A list of special variables that can be toggled to change functionality.
- ri/use-evil-mode :: if non-nil, set up Emacs with evil-mode. Otherwise, use meow-mode.
  - (this is not set up yet)

#+begin_src emacs-lisp

  (setq ri/use-evil-mode nil)

#+end_src

* basics

Basic configuration of the user interface (includes disable bell, fonts, transparency, etc).

