dotfiles/emacs-old/.config/oldmacs.d/init.el

(unless (featurep 'straight)
  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
        (bootstrap-version 6))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage)))

(straight-use-package 'use-package) ; use-package calls will be sent to use-package
(setq straight-use-package-by-default t) ; no need to put :straight

;; Load the helper package for commands like `straight-x-clean-unused-repos'
(require 'straight-x)

;; (package-install 'setup) ; no longer using package.el (using straight.el)
(straight-use-package '(setup :type git :host nil :repo "https://git.sr.ht/~pkal/setup"))
(require 'setup)

;; Uncomment this for debugging purposes
;; (defun dw/log-require (&rest args)
;;   (with-current-buffer (get-buffer-create "*require-log*")
;;     (insert (format "%s\n"
;;                     (file-name-nondirectory (car args))))))
;; (add-to-list 'after-load-functions #'dw/log-require)

;; Recipe is always a list
;; Install via Guix if length == 1 or :guix t is present

(defvar ri/guix-emacs-packages '()
  "Contains a list of all Emacs package names that must be
installed via Guix.")

;; Examples:
;; - (org-roam :straight t)
;; - (git-gutter :straight git-gutter-fringe)

(defun ri/filter-straight-recipe (recipe)
  (let* ((plist (cdr recipe))
         (name (plist-get plist :straight)))
    (cons (if (and name (not (equal name t)))
              name
            (car recipe))
          (plist-put plist :straight nil))))

(setup-define :pkg
  (lambda (&rest recipe)
    (if (and ri/is-guix-system	; modified, but will this break?
             nil ; DISABLE
             (or (eq (length recipe) 1)
                 (plist-get (cdr recipe) :guix)))
        ;; if ri/is-guix-system and regular input, install w/ guix.
        (progn `(add-to-list 'ri/guix-emacs-packages
                             ,(or (plist-get recipe :guix)
                                  (concat "emacs-" (symbol-name (car recipe))))))
      ;; else, install directly with straight.el
      `(straight-use-package ',(ri/filter-straight-recipe recipe))))
  :documentation "Install RECIPE via Guix or straight.el"
  :shorthand #'cadr)

(setup-define :delay
  (lambda (&rest time)
    `(run-with-idle-timer ,(or time 1)
                          nil ;; Don't repeat
                          (lambda () (require ',(setup-get 'feature)))))
  :documentation "Delay loading the feature until a certain amount of idle time has passed.")

(setup-define :disabled
  (lambda ()
    `,(setup-quit))
  :documentation "Always stop evaluating the body.")

(setup-define :load-after
  (lambda (features &rest body)
    (let ((body `(progn
                   (require ',(setup-get 'feature))
                   ,@body)))
      (dolist (feature (if (listp features)
                           (nreverse features)
                         (list features)))
        (setq body `(with-eval-after-load ',feature ,body)))
      body))
  :documentation "Load the current feature after FEATURES."
  :indent 1)

;; Change the user-emacs-directory to keep unwanted things out of ~/.emacs.d
;; UNNECESSARY CHANGE, CHANGE BACK!
(setq user-emacs-directory ;; should be directory of init.el or Emacs.org
      (file-name-directory (or load-file-name (buffer-file-name))))
(setq user-init-file ;; init.el in user-emacs-directory
      (concat user-emacs-directory "init.el"))
(setq url-history-file (expand-file-name "url/history" user-emacs-directory))

;; no-littering
(setup (:pkg no-littering)
  (require 'no-littering)) ; is the require statement really necessary?

;; keep autosaves in emacs dir
(setq auto-save-file-name-transforms
      `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))

(setq backup-directory-alist
      `(("." . ,(expand-file-name ".backup/" user-emacs-directory))))

;; method 1
;; Keep customization settings in a temporary file (does this even work?)
;; (setq custom-file
;;       (if (boundp 'server-socket-dir)
;;           (expand-file-name "custom.el" server-socket-dir)
;;         (expand-file-name (format "emacs-custom-%s.el" (user-uid)) temporary-file-directory)))
;; (load custom-file t)

;; method 2
(setq custom-file (make-temp-file "emacs-custom"))

;; add user lisp files to path
;; (push vs add-to-list?)
(push (concat user-emacs-directory "lisp/") load-path)

(require 'server)
(with-eval-after-load 'server
  ;; if an instance of emacs is not running, then start server.
  (unless (and (boundp 'server-process)
               (processp server-process)
               (server-running-p))
    (server-start)
    (message "Emacsclient Server started!")
    ))

(setq ri/exwm-enabled
      (and (eq window-system 'x)
           ;; returns 't if process with exwm exists
           (let ((exwm-process (string-to-number
                                (shell-command-to-string
                                 "ps aux | grep exwm | grep -vc grep")))) ;<
             (> exwm-process 0))
           ;; (string-match-p "exwm" (format "%s" command-line-args))
           ;; (seq-contains command-line-args "--start-exwm") 
           (if (eq window-system 'pgtk)
               (progn (message "ERROR: You cant start EXWM bc Emacs was compiled with pgtk!")
                      nil)
             t)))

(when ri/exwm-enabled
  (message "exwm-enabled!")
  (require 'ri-desktop))

(setq ri/use-evil-mode nil)
