dotfiles/emacs-old/.config/oldmacs.d/Emacs.org
** basic tweaks

#+begin_src emacs-lisp
  ;; disable startup screen
  (setq inhibit-startup-message nil)

  ;; disable ui
  (scroll-bar-mode -1) ; disable visible scrollbar
  (tool-bar-mode -1)   ; disable the toolbar
  (tooltip-mode 1)     ; disable tooltips
  (set-fringe-mode 10) ; give some breathing room
  (menu-bar-mode -1)   ; disable menu bar

  ;; other
  (setq fill-column 70) ; shadowed by visual-fill-column if visual-fill-column-mode is non-nil.
  (recentf-mode 1) ; show recent files when viewing files (counsel enables by def).
  (save-place-mode 1) ; go to previous location in file when reopening.

#+end_src

** disable bell

Disables the bell (i think).

#+begin_src emacs-lisp

  ;; disable bell
  (setq ring-bell-function 'ignore) ; TURN OFF ONCE AND FOR ALL?
  ;; (setq ring-bell-function 'silent) ; TURN OFF ONCE AND FOR ALL?

  ;; enable mode line flash bell
  ;; (use-package mode-line-bell
  ;; :if (ring-bell-function 'ignore)
  ;; :config
  ;; (mode-line-bell-mode))


#+end_src

** line numbers

Show line numbers to the side of all buffers, except the ones listed.

#+begin_src emacs-lisp

  ;; add line numbers
  (global-display-line-numbers-mode t)
  (column-number-mode) ; (columns on modeline)

  ;; line number mode exceptions
  (dolist (mode '(org-mode-hook
                  dired-mode-hook
                  term-mode-hook
                  vterm-mode-hook
                  shell-mode-hook
                  eshell-mode-hook
                  image-minor-mode-hook
                  doc-view-minor-mode-hook
                  treemacs-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))

#+end_src

** fonts + org-fonts

Generic font configuration.

Fonts are configured using =set-face-attribute=.

What does each face configure?
- default :: modeline, minibuffer, simple applications, etc.
- fixed-pitch :: code-blocks, property, startup, etc.
- variable-pitch :: toc-links, regular text in org-mode, etc.

=M-x list-faces-display= to view all font faces.

For org-mode bullet and font settings, look in [[#org-fonts]].

#+begin_src emacs-lisp

  ;; default font (modeline, minibuffer, default for applications, etc)
  (set-face-attribute 'default nil :font "Fira Code" :height 110 :foreground "white")
  ;; (set-face-attribute 'default nil :font "JetBrains Mono" :height 115)

  ;; fixed pitch font (code blocks, property, startup, etc (can add more))
  (set-face-attribute 'fixed-pitch nil :font "Fira Code" :height 110)

  ;; variable pitch font (toc links, regular text in org, etc...)
  ;; how about Iosveka instead?
  ;; (bullets are configured in org-fonts)
  (set-face-attribute 'variable-pitch nil :font "DejaVu Sans" :height 125 :weight 'regular)

#+end_src

Generic font config: [[#fonts]]

#+begin_src emacs-lisp

  (require 'org)
  (defun ri/org-font-setup ()
    (interactive)
    (set-face-attribute 'org-document-title nil :weight 'bold :height 1.5)
    (dolist (face '((org-level-1 . 1.3)
                    (org-level-2 . 1.25)
                    (org-level-3 . 1.2)
                    (org-level-4 . 1.1)
                    (org-level-5 . 1.0)
                    (org-level-6 . 1.0)
                    (org-level-7 . 1.0)
                    (org-level-8 . 1.0)))
      ;; font for bullets
      (set-face-attribute (car face) nil :font "Liberation Mono" :weight 'bold :height (cdr face))
      ;; (set-face-attribute (car face) nil :font "" :weight 'bold :height (cdr face))
      )

    ;; Ensure that anything that should be fixed-pitch in Org files appears that way
    (set-face-attribute 'org-block nil    :foreground nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-table nil    :inherit 'fixed-pitch)
    (set-face-attribute 'org-formula nil  :inherit 'fixed-pitch :height 1.5)
    (set-face-attribute 'org-code nil     :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-table nil    :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-checkbox nil  :inherit 'fixed-pitch)
    (set-face-attribute 'line-number nil :inherit 'fixed-pitch)
    (set-face-attribute 'line-number-current-line nil :inherit 'fixed-pitch)

    (set-face-attribute 'org-hide nil :inherit 'fixed-pitch) ; fixes indentation

    ;; more options that can be set:
    (set-face-attribute 'org-tag nil :inherit '(shadow) :weight 'bold)
    ;; (set-face-attribute 'org-document-info :foreground "dark orange")
    ;; (set-face-attribute 'org-document-info-keyword :inherit (shadow fixed-pitch))
    ;; (set-face-attribute 'org-indent :inherit '(org-hide fixed-pitch))
    ;; (set-face-attribute 'org-indent nil :inherit '(org-hide fixed-pitch)) ; hide stars
    ;; (set-face-attribute 'org-link :foreground "royal blue" :underline t)
    ;; (set-face-attribute 'org-property-value :inherit fixed-pitch)
    )

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  "font-dejavu"

#+end_src

** fontaine

[[https://github.com/protesilaos/fontaine][Github - fontaine]]

An easier way to configure fonts in Emacs? Though setting this up will take a lot of time and effort, so I'll come back to this one later.

#+begin_src emacs-lisp

  (use-package fontaine)

#+end_src

** improved scrolling

Improve scrolling functionality. When moving your cursor off-screen, the screen will move along with it for a few lines, then jump forward half a page.

#+begin_src emacs-lisp

  (setq mouse-wheel-scroll-amount '(2 ((shift) . 2))) ; scroll when using mouse wheel.
  (setq mouse-wheel-progressive-speed nil) ; don't accelerate scrolling.
  (setq mouse-wheel-follow-mouse 't) ; scroll window under mouse regardless of focus.
  (setq scroll-conservatively 0) ; move window when moving off screen.
  (setq scroll-margin 0) ; margin before scroll at top and bottom of screen.
  (setq scroll-step 1) ; keyboard scroll one line at a time.
  (setq use-dialog-box nil) ; (change to nil) make things like yes or no prompts dialogue boxes.

#+end_src

