dotfiles/emacs-old/.config/oldmacs.d/Emacs.org
** transparency

If =ri/exwm-enabled=, make the background transparent.

With transparency in Emacs, it affects not just the background, but also the text, so it cannot be too transparent. True Emacs transparency will become available in future versions of Emacs, however.

True background transparency (ver. 29.0.90):
- [[https://kristofferbalintona.me/posts/202206071000/][Blog post describing how to use and configure it!]]
- [[https://www.reddit.com/r/emacs/comments/v72tu6/new_emacs_frame_parameter_for_transparency/][Reddit post talking about it]]
- [[https://github.com/emacs-mirror/emacs/commit/5c87d826201a5cae242ce5887a0aa7e24ad6f5ee][Git commit that introduces it - 29.0.90]]

#+name: Eval this to get version-number.
#+begin_src emacs-lisp :tangle no

  ;; ;; For current frame
  ;; (set-frame-parameter nil 'alpha-background 70)
  ;; ;; For all new frames henceforth
  ;; (add-to-list 'default-frame-alist '(alpha-background . 90))

  emacs-version

#+end_src

#+RESULTS: Eval this to get version-number.
: 29.1

#+begin_src emacs-lisp

  ;; set transparency
  (defvar ri/transparency-value 94)

  (message "TEST: %s" default-frame-alist)

  (defun ri/transparency--on-all-frames ()
    "Cycles through and updates transparency value on all existing frames"
    (interactive)
    (let ((iframe (selected-frame))
          (frame (selected-frame)))
      ;; set transparency for the init workspace (god my elisp is messy...)
      (set-frame-parameter
       (eval frame) 'alpha (cons ri/transparency-value ri/transparency-value))
      (setq frame (next-frame frame))
      (while (not (equal iframe frame))
        (set-frame-parameter
         (eval frame) 'alpha (cons ri/transparency-value ri/transparency-value))
        (setq frame (next-frame frame)))))

  (defun ri/transparency--default-value-on-new-frame ()
    "Update the default frame transparency value"
    (interactive)
    ;; delete default transparency entry from default-frame-alist.
    (setq default-frame-alist (assoc-delete-all 'alpha default-frame-alist))
    ;; add new default transparency value to alist.
    (add-to-list
     'default-frame-alist (cons 'alpha (cons ri/transparency-value ri/transparency-value))))

  (defun ri/update-transparency ()
    "Update both the current transparency on all frames, as well as the
  default value for new frames created"
    (interactive)
    (ri/transparency--on-all-frames)
    (ri/transparency--default-value-on-new-frame))

  (defun ri/change-transparency (value)
    "Prompt the user to enter a new transparency value for all existing
  and future frames"
    (interactive "nEnter new transparency value (0 - 100): ")
    (setq ri/transparency-value value)
    (ri/update-transparency))

  ;; Startup
  (when ri/exwm-enabled
    ;; maximize windows by default
    ;; (message "DEBUG: disabled regular transparency for now!")
    (set-frame-parameter (selected-frame) 'fullscreen 'maximized)
    (add-to-list 'default-frame-alist '(fullscreen . maximized))
    ;; new transparency options:
    ;; (set-frame-parameter nil 'alpha-background 80) ; For current frame
    ;; (add-to-list 'default-frame-alist '(alpha-background . 80)) ; For all new frames henceforth
    ;; Define transparency in theme declaration
    )

  (message "TEST: %s" default-frame-alist)

  ;; Notes:

  ;; (modify-all-frames-parameters '((cons 'alpha (cons ri/def-transparency ri/def-transparency))))

  ;; (add-to-list ; works!!!
  ;; 'default-frame-alist (cons 'alpha ri/def-transparency))
  ;; (set-frame-parameter ;; set current workspace transparency to
  ;;  (selected-frame) 'alpha (cons ri/def-transparency ri/def-transparency))

  ;; (set-frame-parameter (selected-frame) 'alpha '(100 . 100))
  ;; (add-to-list 'default-frame-alist '(alpha . (100 . 100))

#+end_src

** shorten y-n prompt

make the yes-no prompt a single letter (y/n).

#+begin_src emacs-lisp

  ;; shorten y-n prompt
  (defalias 'yes-or-no-p 'y-or-n-p)

#+end_src

** replace GUI popup menus

not too sure what this does but it probably improves things. (already inside ace (enable?))
[[https://github.com/mrkkrp/ace-popup-menu][Github - ace-popup-menu]]

#+begin_src emacs-lisp

  (use-package ace-popup-menu
    :config
    ;; (require 'ace-popup-menu)
    (ace-popup-menu-mode 1))

#+end_src

** all-the-icons

icon font pack used by many programs.

#+begin_src emacs-lisp

  ;; all-the-icons
  ;; note: on a new machine, must run M-x all-the-icons-install-fonts
  ;; create a script to automatatically detect whether this has been run?
  (setup (:pkg all-the-icons)
    (if (eq (string-to-number
  	   (shell-command-to-string "fc-list | grep -c 'all-the-icons'"))
  	  '0)
        (all-the-icons-install-fonts)))

#+end_src

*Guix packages:*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  "fontconfig" ; for fc-list
  "emacs-all-the-icons"

#+end_src

** nerd-fonts

icon font pack used by doom-modeline.

#+begin_src emacs-lisp

  ;; nerd-fonts (used by doom-modeline by default)
  ;; note: on a new machine, must run M-x nerd-icons-install-fonts
  (use-package nerd-icons
    :config
    (if (eq (string-to-number
	     (shell-command-to-string "fc-list | grep -c 'NFM'"))
	    '0)
	(nerd-icons-install-fonts)))

#+end_src

* basic functionality

Adds basic functionality to Emacs (includes auto-update, load generic-functions, etc.):

** misc configuration tools

#+begin_src emacs-lisp

  ;; for directories and such
  (setup (:pkg f))

#+end_src

*Guix packages:*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  "emacs-f"

#+end_src

** auto-update packages (disabled)

*Disabled tangling since it doesn't work with =straight.el=.*

+ M-x auto-update-package-now to run immediately
+ Updates can break Emacs, so only update when

Doesn't work with straight.el, so just ~straight-pull-all~ every once in a while, or create a script.

#+begin_src emacs-lisp :tangle no

  (use-package auto-package-update
    :disabled
    :custom
    (auto-package-update-interval 7)
    (auto-package-update-prompt-before-update t)
    (auto-package-update-hide-results nil) ; hide pane to see what packages were updated
    :config
    (auto-package-update-maybe)
    (auto-package-update-at-time "15:00"))

#+end_src

** load custom functions

#+begin_src emacs-lisp

  (require 'generic-functions)
  (require 'ri-git-interface-commands)

#+end_src

** auto-revert changed files

#+begin_src emacs-lisp

  ;; Revert Dired and other buffers
  (setq global-auto-revert-non-file-buffers t)

  ;; Revert buffers when the underlying file has changed
  (global-auto-revert-mode 1)

#+end_src

* keybindings

Configure keybind-related things here (includes meow, general.el, window-management, etc.):

** make escape quit

Make <escape> quit.

#+begin_src emacs-lisp

  ;; ESC to quit prompts
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
  ;; (global-set-key (kbd "<escape>") #'god-mode-all)
  ;; (global-set-key (kbd "<escape>") #'god-local-mode)

#+end_src

