dotfiles/emacs-old/.config/oldmacs.d/init.el
(defvar ri/transparency-value 94)

(message "TEST: %s" default-frame-alist)

(defun ri/transparency--on-all-frames ()
  "Cycles through and updates transparency value on all existing frames"
  (interactive)
  (let ((iframe (selected-frame))
        (frame (selected-frame)))
    ;; set transparency for the init workspace (god my elisp is messy...)
    (set-frame-parameter
     (eval frame) 'alpha (cons ri/transparency-value ri/transparency-value))
    (setq frame (next-frame frame))
    (while (not (equal iframe frame))
      (set-frame-parameter
       (eval frame) 'alpha (cons ri/transparency-value ri/transparency-value))
      (setq frame (next-frame frame)))))

(defun ri/transparency--default-value-on-new-frame ()
  "Update the default frame transparency value"
  (interactive)
  ;; delete default transparency entry from default-frame-alist.
  (setq default-frame-alist (assoc-delete-all 'alpha default-frame-alist))
  ;; add new default transparency value to alist.
  (add-to-list
   'default-frame-alist (cons 'alpha (cons ri/transparency-value ri/transparency-value))))

(defun ri/update-transparency ()
  "Update both the current transparency on all frames, as well as the
default value for new frames created"
  (interactive)
  (ri/transparency--on-all-frames)
  (ri/transparency--default-value-on-new-frame))

(defun ri/change-transparency (value)
  "Prompt the user to enter a new transparency value for all existing
and future frames"
  (interactive "nEnter new transparency value (0 - 100): ")
  (setq ri/transparency-value value)
  (ri/update-transparency))

;; Startup
(when ri/exwm-enabled
  ;; maximize windows by default
  ;; (message "DEBUG: disabled regular transparency for now!")
  (set-frame-parameter (selected-frame) 'fullscreen 'maximized)
  (add-to-list 'default-frame-alist '(fullscreen . maximized))
  ;; new transparency options:
  ;; (set-frame-parameter nil 'alpha-background 80) ; For current frame
  ;; (add-to-list 'default-frame-alist '(alpha-background . 80)) ; For all new frames henceforth
  ;; Define transparency in theme declaration
  )

(message "TEST: %s" default-frame-alist)

;; Notes:

;; (modify-all-frames-parameters '((cons 'alpha (cons ri/def-transparency ri/def-transparency))))

;; (add-to-list ; works!!!
;; 'default-frame-alist (cons 'alpha ri/def-transparency))
;; (set-frame-parameter ;; set current workspace transparency to
;;  (selected-frame) 'alpha (cons ri/def-transparency ri/def-transparency))

;; (set-frame-parameter (selected-frame) 'alpha '(100 . 100))
;; (add-to-list 'default-frame-alist '(alpha . (100 . 100))

;; shorten y-n prompt
(defalias 'yes-or-no-p 'y-or-n-p)

(use-package ace-popup-menu
  :config
  ;; (require 'ace-popup-menu)
  (ace-popup-menu-mode 1))

;; all-the-icons
;; note: on a new machine, must run M-x all-the-icons-install-fonts
;; create a script to automatatically detect whether this has been run?
(setup (:pkg all-the-icons)
  (if (eq (string-to-number
  	 (shell-command-to-string "fc-list | grep -c 'all-the-icons'"))
  	'0)
      (all-the-icons-install-fonts)))

;; nerd-fonts (used by doom-modeline by default)
;; note: on a new machine, must run M-x nerd-icons-install-fonts
(use-package nerd-icons
  :config
  (if (eq (string-to-number
	   (shell-command-to-string "fc-list | grep -c 'NFM'"))
	  '0)
      (nerd-icons-install-fonts)))

;; for directories and such
(setup (:pkg f))

(require 'generic-functions)
(require 'ri-git-interface-commands)

;; Revert Dired and other buffers
(setq global-auto-revert-non-file-buffers t)

;; Revert buffers when the underlying file has changed
(global-auto-revert-mode 1)

;; ESC to quit prompts
(global-set-key (kbd "<escape>") 'keyboard-escape-quit)
;; (global-set-key (kbd "<escape>") #'god-mode-all)
;; (global-set-key (kbd "<escape>") #'god-local-mode)
