dotfiles/emacs-old/.config/oldmacs.d/Emacs.org
** TODO: evil-mode

Config tips:
- https://github.com/noctuid/evil-guide
- https://nathantypanski.com/blog/2014-08-03-a-vim-like-emacs-config.html

#+begin_src emacs-lisp

  ;; evil-mode exclude
  (defun ri/evil-hook ()
    (dolist (mode '(custom-mode
                    eshell-mode
                    git-rebase-mode
                    erc-mode
                    circe-server-mode
                    circe-chat-mode
                    circe-query-mode
                    sauron-mode
                    term-mode))
      (add-to-list 'evil-emacs-state-modes mode)))

  ;; evil-mode
  (use-package evil
    :disabled
    :commands evil-mode
    :init
    (setq evil-want-C-u-scroll t)
    (setq evil-want-C-i-jump t)
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (setq evil-undo-system 'undo-tree)
    :config
    (add-hook 'evil-mode-hook 'ri/evil-hook)
    (evil-mode 1)
    (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
    (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join) ; wowie

    ;; Use visual line motions even outside of visual-line-mode buffers
    ;; -- haven't set up visual line mode yet
    (evil-global-set-key 'motion "j" 'evil-next-visual-line)
    (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

    (evil-set-initial-state 'messages-buffer-mode 'normal)
    (evil-set-initial-state 'dashboard-mode 'normal))
  ;;hook
  ;; have these programs be in emacs-mode (C-z)
  ;;(evil-mode-hook . mi/evil-hook)

  ;; evil collections
  (use-package evil-collection
    :after evil
    :config
    (evil-collection-init))

#+end_src

** TODO: undo-tree/fu (disabled)

https://github.com/apchamberlain/undo-tree.el

breaks for some reason...

#+begin_src emacs-lisp :tangle no

  ;; To change to undo-tree, update evil-undo-system above.
  ;; undo-tree for evil-undo
  ;; (use-package undo-tree
  ;;   :after evil
  ;;   :init
  ;;   (global-undo-tree-mode 1)
  ;;   :config
  ;;   (setq undo-tree-history-directory-alist
  ;;    '(("." . (concat user-emacs-directory "var/undo-tree-his/")))))

  ;; Whenever you C-/ it does the default undo. Not undo-fu-undo. So, maybe
  ;;  bind C-/ to undo-fu-undo without overwriting? but maybe it's ok...

  (setup (:pkg undo-fu)
    (:global "C-z" undo-fu-only-undo
             "C-S-z" undo-fu-only-redo))

  ;; (use-package undo-fu-session
  ;;   :after undo-fu
  ;;   :config
  ;;   (undo-fu-session-global-mode t))

  (setup (:pkg undo-fu-session)
    (:load-after undo-fu)
    (undo-fu-session-global-mode t))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  "emacs-undo-fu"
  "emacs-undo-fu-session"

#+end_src

** general.el

https://github.com/noctuid/general.el

use straight t because it breaks for some reason.

#+begin_src emacs-lisp

  ;; general.el
  ;; (use-package general)
  (setup (:pkg general :straight t)
    :config
    (general-create-definer leader-key-def
      :prefix "C-c"))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  "emacs-general"

#+end_src

** general.el generic binds

Generic keybinds

#+begin_src emacs-lisp

  (defun ri/save-and-meow-normal-mode ()
    (interactive)
    (meow-insert-exit)
    (save-buffer))
  ;; save and normal mode
  (leader-key-def
    "c" '(ri/save-and-meow-normal-mode :which-key "save and normal mode")
    "h" '(ri/save-and-meow-normal-mode :which-key "save and normal mode"))

#+end_src

Special and Help

#+begin_src emacs-lisp

  (leader-key-def
    "s" '(:ignore t :which-key "special"))

#+end_src

Quit emacs / session

#+begin_src emacs-lisp

  (leader-key-def
    "q"  '(:ignore t :which-key "quit/session")
    "qq" '(save-buffers-kill-terminal :which-key "quit emacs"))

#+end_src

** hydra

Fast, transient keybinds

use straight t because it breaks for same reason.

#+begin_src emacs-lisp

  ;; hydra (fast, transient keybinds)
  ;; (use-package hydra
  ;;   :defer t)
  (setup (:pkg hydra :straight t))

  (defhydra hydra-text-scale (:timeout 5)
    "scale text"
    ("j" text-scale-decrease "out")
    ("k" text-scale-increase "in")
    ("f" nil "finished" :exit t))

  ;; use another keys
  (leader-key-def
    "ss" '(hydra-text-scale/body :which-key "scale text"))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  "emacs-hydra"

#+end_src

** TODO: crux [where to put?]

Collection of Ridiculously Useful eXtensions

features:
- auto-align elisp
- C-a moves to the first char on the line instead of the beginning.

#+begin_src emacs-lisp

  ;; maybe replace the first bind with replace kill line with crux?
  (use-package crux
    :bind
    ("C-a" . crux-move-beginning-of-line)
    ("C-k" . crux-smart-kill-line)
    ;; Fucks things up in some modes:
    ;; ("C-o" . (lambda (arg) (interactive "P")
    ;;            (if (not arg)
    ;;                (progn
    ;;                  (save-excursion
    ;;                    (electric-newline-and-maybe-indent)))
    ;;              (progn
    ;;                (crux-smart-open-line-above)))))
    :config
    ;; (global-set-key [remap kill-line] 'crux-smart-kill-line)
    (leader-key-def
      "mc" 'crux-cleanup-buffer-or-region))

#+end_src

** TODO?: expand region

#+begin_src emacs-lisp

  (use-package expand-region
    :commands expand-region)

#+end_src

** avy

jump to any char or line

#+begin_src emacs-lisp

  (use-package avy
    :bind ("C-:" . 'avy-goto-char)
    :commands avy)

  (leader-key-def
    "j"  '(:ignore t :which-key "avy")
    "jj" 'avy-goto-char
    "jl" 'avy-goto-line)

#+end_src

** save position in buffer

#+begin_src emacs-lisp

  (global-set-key (kbd "C-r") 'point-to-register)
  (global-set-key (kbd "C-M-r") 'jump-to-register)

#+end_src

** TODO?: cheatsheet

Change to C-h u instead?

#+begin_src emacs-lisp

  (use-package cheatsheet
    :bind (("C-h /" . cheatsheet-show)
           :map cheatsheet-mode-map
           ("q" . kill-buffer-and-window))
    :config
    (setq cheatsheet--cheat-list nil)
    (cheatsheet-add-group 'org
                          '(:key "C-c TAB" :description "close current heading"))
    (cheatsheet-add-group 'generic
                          '(:key "C-c C-SPC" :description "jump to previous location in buffer")
                          '(:key "C-c &" :description "jump to previous location any buffer")
                          '(:key "C-x r SPC <k>" :description "save point to registor")
                          '(:key "C-x r SPC <k>" :description "jump to registor"))
    (cheatsheet-add-group 'commands
                          '(:key "org-lint" :description "debug an org file"))
    (cheatsheet-add-group 'general-notes
                          '(:key "emacs-lisp-mode-map" :description "for viewing local keybinds")))


#+end_src

** TODO: free-keys

#+begin_src emacs-lisp

  (use-package free-keys
    :commands free-keys)

  (leader-key-def
    "sF" 'free-keys)

#+end_src

** custom keybinds

#+begin_src emacs-lisp

  ;; keep cursor at same position when scrolling
  (setq scroll-preserve-screen-position 1)
  ;; scroll window up/down by one line
  ;; FIX this by changing C-M-g to command name "universal-argument"?
  (global-set-key (kbd "M-n") (kbd "M-- 1 C-v"))
  (global-set-key (kbd "M-p") (kbd "M-- 1 M-v"))

  (global-set-key (kbd "C-M--") #'complete-symbol)

#+end_src

** TODO?: Make C-j do with C-m

#+begin_src emacs-lisp

  (progn
    ;; (with-eval-after-load 'electric-mode
    ;;   (define-key electric-mode-map (kbd "C-m") #'electric-newline-and-maybe-indent))
    (with-eval-after-load 'org
      (define-key org-mode-map (kbd "C-m") #'org-return-and-maybe-indent)))

#+end_src

** window management

*** window auto balance

#+begin_src emacs-lisp

  (defun ri/delete-window-auto-balance ()
    (interactive)
    (delete-window)
    (balance-windows))

  (defun ri/split-window-right-auto-balance ()
    (interactive)
    (split-window-right)
    (balance-windows))

  (defun ri/split-window-below-auto-balance ()
    (interactive)
    (split-window-below)
    (balance-windows))

  (global-set-key (kbd "C-x 0") #'ri/delete-window-auto-balance)
  (global-set-key (kbd "C-x 2") #'ri/split-window-below-auto-balance)
  (global-set-key (kbd "C-x 3") #'ri/split-window-right-auto-balance)

  ;; breaks a lot of stuff, dont do this...
  ;; (advice-add 'delete-window :after #'balance-windows)
  ;; (advice-add 'split-window-right :after #'balance-windows)
  ;; (advice-add 'split-window-below :after #'balance-windows)

#+end_src

*** ace-window (M-o)

Ace-window (M-o) documentation

https://github.com/abo-abo/ace-window

#+begin_src emacs-lisp

  (use-package ace-window
    :config
    (setq aw-scope 'frame)
    (setq aw-keys '(?a ?o ?e ?u ?h ?t ?n ?g ?c ?r))
    (defvar aw-dispatch-alist
      '((?d aw-delete-window "Delete Window")
        (?1 delete-other-windows "Delete Other Windows")
        (?s aw-split-window-horz "Split Horz Window")
        (?v aw-split-window-vert "Split Vert Window")
        (?, aw-split-window-fair "Split Fair Window")
        (?o aw-flip-window "Other Window")
        (?w aw-swap-window "Swap Windows")
        (?m aw-move-window "Move Window")
        (?c aw-copy-window "Copy Window")
        (?b aw-switch-buffer-in-window "Select Buffer")
        (?B aw-switch-buffer-other-window "Switch Buffer Other Window")
        (?? aw-show-dispatch-help))
      "List of actions for `aw-dispatch-default'.")
    (global-set-key (kbd "M-o") 'ace-window))

#+end_src

