dotfiles/emacs-old/.config/oldmacs.d/init.el

;; evil-mode exclude
(defun ri/evil-hook ()
  (dolist (mode '(custom-mode
                  eshell-mode
                  git-rebase-mode
                  erc-mode
                  circe-server-mode
                  circe-chat-mode
                  circe-query-mode
                  sauron-mode
                  term-mode))
    (add-to-list 'evil-emacs-state-modes mode)))

;; evil-mode
(use-package evil
  :disabled
  :commands evil-mode
  :init
  (setq evil-want-C-u-scroll t)
  (setq evil-want-C-i-jump t)
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-undo-system 'undo-tree)
  :config
  (add-hook 'evil-mode-hook 'ri/evil-hook)
  (evil-mode 1)
  (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
  (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join) ; wowie

  ;; Use visual line motions even outside of visual-line-mode buffers
  ;; -- haven't set up visual line mode yet
  (evil-global-set-key 'motion "j" 'evil-next-visual-line)
  (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

  (evil-set-initial-state 'messages-buffer-mode 'normal)
  (evil-set-initial-state 'dashboard-mode 'normal))
;;hook
;; have these programs be in emacs-mode (C-z)
;;(evil-mode-hook . mi/evil-hook)

;; evil collections
(use-package evil-collection
  :after evil
  :config
  (evil-collection-init))

;; general.el
;; (use-package general)
(setup (:pkg general :straight t)
  :config
  (general-create-definer leader-key-def
    :prefix "C-c"))

(defun ri/save-and-meow-normal-mode ()
  (interactive)
  (meow-insert-exit)
  (save-buffer))
;; save and normal mode
(leader-key-def
  "c" '(ri/save-and-meow-normal-mode :which-key "save and normal mode")
  "h" '(ri/save-and-meow-normal-mode :which-key "save and normal mode"))

(leader-key-def
  "s" '(:ignore t :which-key "special"))

(leader-key-def
  "q"  '(:ignore t :which-key "quit/session")
  "qq" '(save-buffers-kill-terminal :which-key "quit emacs"))

;; hydra (fast, transient keybinds)
;; (use-package hydra
;;   :defer t)
(setup (:pkg hydra :straight t))

(defhydra hydra-text-scale (:timeout 5)
  "scale text"
  ("j" text-scale-decrease "out")
  ("k" text-scale-increase "in")
  ("f" nil "finished" :exit t))

;; use another keys
(leader-key-def
  "ss" '(hydra-text-scale/body :which-key "scale text"))

;; maybe replace the first bind with replace kill line with crux?
(use-package crux
  :bind
  ("C-a" . crux-move-beginning-of-line)
  ("C-k" . crux-smart-kill-line)
  ;; Fucks things up in some modes:
  ;; ("C-o" . (lambda (arg) (interactive "P")
  ;;            (if (not arg)
  ;;                (progn
  ;;                  (save-excursion
  ;;                    (electric-newline-and-maybe-indent)))
  ;;              (progn
  ;;                (crux-smart-open-line-above)))))
  :config
  ;; (global-set-key [remap kill-line] 'crux-smart-kill-line)
  (leader-key-def
    "mc" 'crux-cleanup-buffer-or-region))

(use-package expand-region
  :commands expand-region)

(use-package avy
  :bind ("C-:" . 'avy-goto-char)
  :commands avy)

(leader-key-def
  "j"  '(:ignore t :which-key "avy")
  "jj" 'avy-goto-char
  "jl" 'avy-goto-line)

(global-set-key (kbd "C-r") 'point-to-register)
(global-set-key (kbd "C-M-r") 'jump-to-register)

(use-package cheatsheet
  :bind (("C-h /" . cheatsheet-show)
         :map cheatsheet-mode-map
         ("q" . kill-buffer-and-window))
  :config
  (setq cheatsheet--cheat-list nil)
  (cheatsheet-add-group 'org
                        '(:key "C-c TAB" :description "close current heading"))
  (cheatsheet-add-group 'generic
                        '(:key "C-c C-SPC" :description "jump to previous location in buffer")
                        '(:key "C-c &" :description "jump to previous location any buffer")
                        '(:key "C-x r SPC <k>" :description "save point to registor")
                        '(:key "C-x r SPC <k>" :description "jump to registor"))
  (cheatsheet-add-group 'commands
                        '(:key "org-lint" :description "debug an org file"))
  (cheatsheet-add-group 'general-notes
                        '(:key "emacs-lisp-mode-map" :description "for viewing local keybinds")))

(use-package free-keys
  :commands free-keys)

(leader-key-def
  "sF" 'free-keys)

;; keep cursor at same position when scrolling
(setq scroll-preserve-screen-position 1)
;; scroll window up/down by one line
;; FIX this by changing C-M-g to command name "universal-argument"?
(global-set-key (kbd "M-n") (kbd "M-- 1 C-v"))
(global-set-key (kbd "M-p") (kbd "M-- 1 M-v"))

(global-set-key (kbd "C-M--") #'complete-symbol)

(progn
  ;; (with-eval-after-load 'electric-mode
  ;;   (define-key electric-mode-map (kbd "C-m") #'electric-newline-and-maybe-indent))
  (with-eval-after-load 'org
    (define-key org-mode-map (kbd "C-m") #'org-return-and-maybe-indent)))

(defun ri/delete-window-auto-balance ()
  (interactive)
  (delete-window)
  (balance-windows))

(defun ri/split-window-right-auto-balance ()
  (interactive)
  (split-window-right)
  (balance-windows))

(defun ri/split-window-below-auto-balance ()
  (interactive)
  (split-window-below)
  (balance-windows))

(global-set-key (kbd "C-x 0") #'ri/delete-window-auto-balance)
(global-set-key (kbd "C-x 2") #'ri/split-window-below-auto-balance)
(global-set-key (kbd "C-x 3") #'ri/split-window-right-auto-balance)

;; breaks a lot of stuff, dont do this...
;; (advice-add 'delete-window :after #'balance-windows)
;; (advice-add 'split-window-right :after #'balance-windows)
;; (advice-add 'split-window-below :after #'balance-windows)

(use-package ace-window
  :config
  (setq aw-scope 'frame)
  (setq aw-keys '(?a ?o ?e ?u ?h ?t ?n ?g ?c ?r))
  (defvar aw-dispatch-alist
    '((?d aw-delete-window "Delete Window")
      (?1 delete-other-windows "Delete Other Windows")
      (?s aw-split-window-horz "Split Horz Window")
      (?v aw-split-window-vert "Split Vert Window")
      (?, aw-split-window-fair "Split Fair Window")
      (?o aw-flip-window "Other Window")
      (?w aw-swap-window "Swap Windows")
      (?m aw-move-window "Move Window")
      (?c aw-copy-window "Copy Window")
      (?b aw-switch-buffer-in-window "Select Buffer")
      (?B aw-switch-buffer-other-window "Switch Buffer Other Window")
      (?? aw-show-dispatch-help))
    "List of actions for `aw-dispatch-default'.")
  (global-set-key (kbd "M-o") 'ace-window))
