dotfiles/emacs-old/.config/oldmacs.d/Emacs.org
*** TODO?: move windows around

#+begin_src emacs-lisp

  ;; not downloaded from melpa, because the latest commit is broken.
  ;; instead downloaded from emacswiki website and loaded from `./lisp/'.
  ;; Issue: [[https://github.com/lukhas/buffer-move/issues/18]]
  ;; Homepage: [[https://www.emacswiki.org/emacs/buffer-move.el]]
  (require 'buffer-move)

  ;; bind this to a keybind?
  (defhydra ri/hydra-window-adjust (:timeout 5)
    "scale windows"
    ("h" (shrink-window-horizontally -5))
    ("s" (shrink-window-horizontally 5))
    ("t" (shrink-window -5))
    ("n" (shrink-window 5))
    ("H" (buf-move-left))
    ("S" (buf-move-right))
    ("T" (buf-move-up))
    ("N" (buf-move-down))
    ("r" (message "reset!"))
    ("g" nil "finished" :exit t))

  (global-set-key (kbd "C-M-)") #'ri/hydra-window-adjust/body)

#+end_src

*** TODO?: custom quit window if special

#+begin_src emacs-lisp

  ;; Update this to where if no match, quit-window the latest window (maybe with get-mru-window
  ;;  or maybe the old function that i scrapped before a commit...) and if universal-argument,
  ;;  do the last visited window.
  (defun ri/quit-temp-window ()
    "Run `quit-window' on a window in the current frame if it's one of the specified,
  temporary buffers, like `*cargo-run*'"
    (interactive)
    ;; iwindow - initial window
    (let* ((iwindow (selected-window))
           (ibuffer (buffer-name (window-buffer iwindow)))
           (window (next-window))
           (buffer (buffer-name (window-buffer window)))
           (window-to-quit nil))
      (while (not (equal buffer ibuffer))
        (if (or (equal buffer "*cargo-run*"))
            (progn
              (if (not window-to-quit)
                  (setq window-to-quit window)
                (message "There are two windows that can be matched; picking the first..."))))
        (setq window (next-window window))
        (setq buffer (buffer-name (window-buffer window))))
      ;; after complete loop
      (if window-to-quit
          (progn (select-window window-to-quit)
                 (quit-window))
        ;; if no matches, just prompt to quit next-window
        (progn (unless (equal iwindow (next-window iwindow))
                 (select-window (next-window))
                 (if (y-or-n-p "Quit window?")
                     (kill-buffer-and-window)
                   (select-window iwindow)))))))
  
#+end_src

*** leader keybinds

#+begin_src emacs-lisp

  ;; replace evil-direction w/ package
  (leader-key-def
    "w"  '(:ignore t :which-key "window")
    "wv" '(split-window-right :which-key "v-split")
    "ws" '(split-window-below :which-key "h-split")
    "wd" '(delete-window :which-key "close window")
    "wc" '(delete-window :which-key "close window")
    "ww" '(evil-window-next :which-key "next-window")
    "wW" '(evil-window-prev :which-key "prev-window")
    ;;
    "wp" '(windmove-up :which-key "window-up")
    "wt" '(windmove-up :which-key "window-up")
    "wn" '(windmove-down :which-key "window-down")
    ;;
    "wb" '(windmove-left :which-key "window-left")
    "wf" '(windmove-right :which-key "window-right")
    "ww" '(aw-flip-window :which-key "other-window")
    ;;
    ;; "wH" '(evil-window-move-far-left :which-key "move left")
    ;; "wJ" '(evil-window-move-very-bottom :which-key "move down")
    ;; "wK" '(evil-window-move-very-top :which-key "move up")
    ;; "wL" '(evil-window-move-far-right :which-key "move right")
    "wa" '(hydra-window-adjust/body :which-key "window-ratio-adjust")
    "wi" '(:ignore t :which-key "minibuffer")
    "wie" 'minibuffer-keyboard-quit
    "wio" 'switch-to-minibuffer)

#+end_src

** buffer management

#+begin_src emacs-lisp

  (leader-key-def
    "k" 'kill-current-buffer
    "b" '(:ignore t :which-key "buffer")
    "bk" 'kill-current-buffer
    "bn" 'next-buffer
    "bp" 'previous-buffer
    "bo" 'meow-last-buffer
    "bb" 'counsel-switch-buffer
    "br" 'read-only-mode)

#+end_src

** Key quiz!!!

https://github.com/federicotdn/key-quiz

#+begin_src emacs-lisp

  (setup (:pkg key-quiz)
    (:global "C-c z k" key-quiz))

#+end_src

* Magit

Magit breaks for some reason when i put it down lower in the configuration, so it's put here temorarily.

#+begin_src emacs-lisp

  ;; magit
  ;; (add several links...)
  ;; (magit-status is C-x g)
  ;; (tab to see diff of files)
  ;; (hunks, "?" for all commands, C-c C-k to quit commit, push to remote, ssh?)
  ;; (learn more about magit...)
  ;; (use-package magit :straight t)
    ;; :bind (:map magit-status-mode-map
    ;;             ("p" . magit-tag)
    ;;             ("t" . magit-section-backward))
    ;; :custom
    ;; what does this do? fullscreen?
    ;; (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1)
    ;; )

  (setup (:pkg magit-todos))

  (setup (:pkg magit :straight t)
    (:also-load magit-todos)
    (:global "C-M-;" magit-status)
    (:option magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

  ;; (setup (:pkg magit-todos))

  (leader-key-def
    "v"  '(:ignore t :which-key "magit")
    "vv" '(magit-status :which-key "magit")) ; (same as magit)

  ;; forge
  ;; (run forge-pull in a repo to pull down)
  ;; (pull down all issues, pull-reqs, etc)
  ;; (need to create a token first, then put in .authinfo)
  ;; - https://magit.vc/manual/forge/Token-Creation.html#Token-Creation
  ;; - https://magit.vc/manual/ghub/Getting-Started.html#Getting-Started
  ;; (use-package forge
  ;;   :disabled
  ;;   :after magit)
  (setup (:pkg forge)
    (:disabled))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  "emacs-magit"
  "emacs-magit-todos"
  "emacs-forge"

#+end_src

* UI Configuration

Here we have the UI configuration.
Includes:
      + ivy
      + counsel
      + doom-themes
      + doom-modeline
      + rainbow-delimiters
      + which-key
      + helpful
      + help menu

      To Add:
      - Make M-n and M-{p,t} go up and down in ivy-minbuffer-map

** TODO/2: ivy + counsel

[[https://oremacs.com/swiper/#key-bindings][ivy documentation - swiper and etc]]

#+begin_src emacs-lisp

  ;; ivy
  (use-package ivy
    :diminish ; hide ivy minor-mode on modeline
    :bind (("C-s" . swiper) ;; fuzzy search tool
           ("C-c s p" . swiper-isearch-thing-at-point)
           :map ivy-minibuffer-map
           ("TAB" . ivy-partial-or-done)
           ("C-M-d" . ivy-immediate-done)
           ;; Evil mode:
           ("C-l" . ivy-alt-done)
           ("C-j" . ivy-next-line)
           ("C-k" . ivy-previous-line)
           :map ivy-switch-buffer-map
           ("C-k" . ivy-previous-line)
           ("C-l" . ivy-done)
           ("C-d" . ivy-switch-buffer-kill)
           :map ivy-reverse-i-search-map
           ("C-k" . ivy-previous-line)
           ("C-d" . ivy-reverse-i-search-kill))
    :custom
    (ivy-height 15)
    ;; fixes bug with swiper breaking when hovering over links.
    ;; After the bug has been fixed, change it back to `text-properties'.
    (org-fold-core-style 'overlays)
    :config
    (message "Ivy got loaded!")
    (ivy-mode 1))

  (use-package ivy-rich
    :after ivy
    :init
    (ivy-rich-mode 1))

  ;; counsel (ivy-enhanced standard emacs commands)
  (use-package counsel
    :bind (;; ("M-x" . counsel-M-x)
           ;; ("C-x b" . counsel-ibuffer)
           ;; ("C-x C-f" . counsel-find-file)
           ("C-x b" . 'counsel-switch-buffer)
           ;; ("s-c" . 'counsel-switch-buffer)
           :map minibuffer-local-map
           ("C-r" . 'counsel-minibuffer-history))
    :custom
    (counsel-linux-app-format-function #'counsel-linux-app-format-function-name-only)
    :config
    (setq ivy-initial-inputs-alist nil) ;; Don't start searches with ^
    (message "Counsel loaded!")
    (counsel-mode 1))

  ;; adds ivy completion regex and order commands by last used
  (use-package ivy-prescient
    :after counsel
    :custom
    (ivy-prescient-enable-filtering nil)
    :config
    ;; Uncomment the following line to have sorting remembered across sessions!
    (prescient-persist-mode 1)
    (ivy-prescient-mode 1))

#+end_src

