dotfiles/emacs-old/.config/oldmacs.d/Emacs.org
** TODO: themes

#+begin_src emacs-lisp

  (use-package ef-themes)

  (use-package catppuccin-theme) ; no use?

  (use-package doom-themes)

  (use-package poet-theme)

  (use-package kaolin-themes)

  ;; (load-theme 'ef-dark t)
  ;; (load-theme 'ef-trio-dark t) ; o 
  ;; (load-theme 'ef-cherie t)
  ;; (load-theme 'ef-winter t) ; o
  ;; (load-theme 'kaolin-valley-dark t)
  ;; (load-theme 'kaolin-bubblegum t) ; dark blue, not bad
  ;; (load-theme 'kaolin-shiva t) ; soft fluffy

  ;; favorites
  ;; (load-theme 'kaolin-eclipse t) ; pink pretty noice, brightest?
  ;; (load-theme 'doom-gruvbox t) ; easy on the eyes and goes well with glt wallpaper

  ;; (load-theme 'doom-dracula t)

  ;; (load-theme 'catppuccin t)

  ;; (load-theme 'doom-snazzy t)
  ;; (load-theme 'doom-laserwave t)
  ;; (when ri/exwm-enabled
  ;; (ri/change-transparency 90)
  ;; (ri/change-transparency 95)
  ;; (ri/change-transparency 100)
  ;; no spectrum, pro, classic
  ;; nice ristretto (dark), 

  ;; test
  (defun mn (suffix)
    (intern 
     (concat "doom-"
             (mapconcat (lambda (i)
                          (byte-to-string i))
                        '(109 111 110 111 107 97 105))
             "-" suffix)))

  (setq ri/theme
        ;; 'doom-gruvbox
        ;; 'doom-material-dark ; sits comfortably
        ;; 'doom-bluloco-dark ; interesting blue
        'doom-moonlight ; feels like the moonlight
        ;; 'doom-sourcerer ; feels like swamp witch
        ;; 'doom-oksolar-dark ; feels like blue-washing (no comments)
        ;; 'doom-old-hope
        ;; 'doom-palenight
        ;; (mn "spectrum") ; no hl
        ;; 'kaolin-eclipse ; best
        ;; 'ef-trio-dark ; nicenice
        ;; 'ef-winter
        ;; 'kaolin-shiva
        )

  (setq ri/themes-and-transparency-alist
        '((kaolin-eclipse . 94)
          (doom-gruvbox   . 94)
          (doom-old-hope   . 94)
          (doom-material-dark . 94)
          (ef-trio-dark . 97)
          (ef-winter . 94)
          (kaolin-shiva . 94)
          ;;
          (catppuccin     . 100)
          (ef-dark        . 100)
          (doom-dracula   . 90)
          (doom-moonlight . 95)
          ))

  (defvar ri/auto-set-transparency t
    "If true, automatically set transparency value corresponding
  to theme.")

  ;;

  (defun ri/set-theme ()
    "Set theme based on ri/theme"
    (load-theme ri/theme t))

  (defun ri/set-transparency-from-theme (&optional current-theme)
    "Set transparency value from theme, based on
  ri/themes-and-transparency-alist"
    (interactive "P")
    (let* ((pair (assoc ri/theme ri/themes-and-transparency-alist))
           (theme (or current-theme (car pair)))
           (opacity (cdr pair)))
      (if (or pair theme opacity)
          (ri/change-transparency opacity)
        (message "Error: theme not found in alist or not set correctly."))))

  ;; (defun ri/set-theme-and-transparency ()
  ;;   (interactive)
  ;;   (let* ((pair (assoc ri/theme ri/themes-and-transparency-alist))
  ;;          (theme (car pair))
  ;;          (opacity (cdr pair)))
  ;;     (if (or pair theme opacity)
  ;;         (progn
  ;;           (load-theme theme t)
  ;;           (if ri/auto-set-transparency
  ;;               (ri/change-transparency opacity)))
  ;;       (message "Error: theme not found in alist or not set correctly."))))

  (ri/set-theme) ; always do
  (when ri/exwm-enabled
    (ri/set-transparency-from-theme))
  (ri/set-transparency-from-theme) ; fuck it lets do this anyway
  ;;

  (defun ri/toggle-theme-auto-transparency ()
    "Enable/disable theme auto transparency"
    (interactive)
    (setq ri/auto-set-transparency (not ri/auto-set-transparency))
    (message "%s" ri/auto-set-transparency))

  (defun ri/set-theme-and-org-font-setup (&optional theme)
    (interactive "P")
    (let ((new-theme-name nil))
      ;; if no input, prompt
      (if (not theme)
          (setq new-theme-name (intern (counsel-load-theme)))
        (load-theme theme t))
      (when ri/exwm-enabled
        (ri/set-transparency-from-theme (or counsel-load-theme theme)))
      (ri/org-font-setup)))

  ;; warning: using this too many times will break the emacs environment.
  ;;  Like literally, everything starts breaking, eventually freezing the system as a whole.
  (defun ri/random-theme ()
    (interactive)
    (let* ((themes (custom-available-themes))
           (n (random (length themes)))
           (pick (nth n themes))
           (loaded (if (null pick) (car themes) pick)))
      (ri/set-theme-and-org-font-setup pick)
      (message "New theme loaded! %s" pick)))

  ;;

  (global-set-key (kbd "C-h T") 'ri/set-theme-and-org-font-setup)

  (leader-key-def
    "st" '(ri/set-theme-and-font-setup :which-key "choose theme")
    "sr" '(ri/random-theme :which-key "random theme"))

#+end_src

** diminish

#+begin_src emacs-lisp

  (use-package diminish)

#+end_src

** doom-modeline

#+begin_src emacs-lisp 

  ;; doom-modeline
  (setup (:pkg doom-modeline)
    (require 'doom-modeline)
    ;; :init (doom-modeline-mode 1)
    ;; (:hook-into after-init-hook)
    ;; Hacky bugfix with modeline
    (display-battery-mode nil)
    (display-time-mode nil)
    (display-battery-mode t)
    (display-time-mode t)
    (doom-modeline-mode 1)
    (:option doom-dracula-brighter-modeline nil
	     doom-modeline-height 32 ; 45? 40? best 20, stuck with 30 for a while
	     doom-modeline-hud nil))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  "emacs-doom-modeline"

#+end_src

** mini-modeline

https://github.com/kiennq/emacs-mini-modeline

https://github.com/OldhamMade/emacs.d

https://github.com/Malabarba/smart-mode-line/

How do you make JUST the modeline/minibuffer text font reaallly big??? That would make this actually prety viable.

#+begin_src emacs-lisp

  (use-package mini-modeline
    :disabled
    ;; :custom
    ;; (mini-modeline-r-format)
    ;; :config
    ;; (mini-modeline-mode t)
    )

#+end_src

** rainbow-delimiters

#+begin_src emacs-lisp

  ;; rainbow delimiters
  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))

#+end_src

** bionic reading

#+begin_src emacs-lisp

  (defvar infu-bionic-reading-face nil "a face for `infu-bionic-reading-region'.")

  (setq infu-bionic-reading-face 'bold)
  ;; try
  ;; 'bold
  ;; 'error
  ;; 'warning
  ;; 'highlight
  ;; or any value of M-x list-faces-display

  (defun infu-bionic-reading-buffer ()
    "Bold the first few chars of every word in current buffer.
  Version 2022-05-21"
    (interactive)
    (infu-bionic-reading-region (point-min) (point-max)))

  (defun infu-bionic-reading-region (Begin End)
    "Bold the first few chars of every word in region.
  Version 2022-05-21"
    (interactive "r")
    (let (xBounds xWordBegin xWordEnd  )
      (save-restriction
        (narrow-to-region Begin End)
        (goto-char (point-min))
        (while (forward-word)
          ;; bold the first half of the word to the left of cursor
          (setq xBounds (bounds-of-thing-at-point 'word))
          (setq xWordBegin (car xBounds))
          (setq xWordEnd (cdr xBounds))
          (setq xBoldEndPos (+ xWordBegin (1+ (/ (- xWordEnd xWordBegin) 2))))
          (put-text-property xWordBegin xBoldEndPos
                             'font-lock-face infu-bionic-reading-face)))))

#+end_src

** modus-themes

#+begin_src emacs-lisp

  ;; (use-package modus-themes
  ;;   :custom
  ;;   ;(modus-themes-mode-line '(borderless))
  ;;   :config
  ;;   (load-theme 'modus-vivendi t))

#+end_src

** which-key

Shows all possible completions for prefixes (C-c, C-x, SPC, etc)

https://github.com/justbur/emacs-which-key

#+begin_src emacs-lisp

  ;; which-key (lists keybinds)
  ;; (add links above source blocks later)
  (use-package which-key
    :defer 0
    :diminish which-key-mode
    :config
    (which-key-mode)
    (setq which-key-idle-delay 0.3))

  ;; (setup (:pkg which-key)
  ;;   (message "DEBUG PLEASE!!!: %s" (:pkg which-key))
  ;;   (diminish 'which-key-mode)
  ;;   (setq which-key-idle-delay 0.3))

#+end_src

** auto balance windows (disabled)

instead of auto-balancing all windows automatically, it's better to just run =balance-windows= after manipulating windows.

#+begin_src emacs-lisp :tangle no

  ;; automatically balance windows after splitting
  (use-package balanced-windows
    :disabled
    :config
    (balanced-windows-mode)

    (dolist (mode '(shell-pop-in-hook
                    ;; shell-pop-out-after-hook
                    ;; shell-pop-in-after-hook ; last, breaks?
                    ;; shell-pop-process-exit-hook
                    ))
      (add-hook mode (lambda () (balanced-windows-mode 0)))))

#+end_src

