dotfiles/emacs-old/.config/oldmacs.d/Emacs.org
** helpful

Shows more info in help menu

useful keybinds:
- C-h b - describe-bindings - search

|-------|
| C-h b |
| C-h R |
|       |

#+begin_src emacs-lisp

  ;; helpful (improves help menu)
  (use-package helpful
    :commands (helpful-callable helpful-variable helpful-command helpful-key)
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable)
    :bind ;; change the function of the command
    ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . counsel-describe-variable)
    ([remap describe-key] . helpful-key)
    ("C-h M" . which-key-show-major-mode)
    ("C-h h" . helpful-at-point)
    ("C-h E" . describe-keymap))

  (leader-key-def
    "sh" 'helpful-at-point
    "sv" 'describe-variable
    "sf" 'describe-function
    "sk" 'describe-key
    "sM" 'which-key-show-major-mode
    "sm" 'describe-mode
    "sR" 'info-display-manual
    "sP" 'describe-package)

#+end_src

** TODO: Info

To implement:
- if Info major mode, disable/toggle SPC meow leader, and reenable with S-SPC

#+begin_src emacs-lisp

  (use-package info
    :bind
    (:map Info-mode-map
          ("j" . Info-scroll-down)
          ("S-SPC" . Info-scroll-up)
          ("v" . Info-scroll-up)
          ("k" . Info-scroll-up)))

#+end_src

** TODO?: perspective.el (disabled)

might not work, so make sure it does.

#+begin_src emacs-lisp :tangle no

  (use-package perspective
    :disabled
    :config
    (setq persp-initial-frame-name "Main") ; def "main"
    (unless (equal persp-mode t)
      (persp-mode)))

#+end_src

** popper (empty)

https://github.com/karthink/popper

Look here for example config: [[file:~/Code/git-cloned/daviwil-dots/Emacs.org::*Taming Popups with Popper.el][Taming Popups with Popper.el]]

#+begin_src emacs-lisp



#+end_src

** TODO?: darkroom

#+begin_src emacs-lisp

  (setup (:pkg darkroom)
    (:global "C-c s D" #'darkroom-tentative-mode))

#+end_src

* Decorative

** dashboard

#+begin_src emacs-lisp

  (setup (:pkg dashboard)
    (require 'dashboard)
    ;; Do this manually instead.
    ;; (dashboard-setup-startup-hook)
    (when (or (< (length command-line-args) 2) ; >
  	    ri/exwm-enabled)
      (add-hook 'after-init-hook (lambda ()
  				 ;; Display useful lists of items
  				 (dashboard-insert-startupify-lists)))
      (add-hook 'emacs-startup-hook (lambda ()
                                      (switch-to-buffer dashboard-buffer-name)
                                      (goto-char (point-min))
                                      (redisplay)
                                      (run-hooks 'dashboard-after-initialize-hook)))))

#+end_src

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  "emacs-dashboard"

#+end_src

** fireplace

[[https://github.com/johanvts/emacs-fireplace][Github - emacs-fireplace]]

#+begin_src emacs-lisp

  (use-package fireplace)

#+end_src

* Other

** TODO?: discover-my-major

[[https://framagit.org/steckerhalter/discover-my-major][Homepage - discover-my-major]]

#+begin_src emacs-lisp

  (setup (:pkg discover-my-major)
    (:global "C-h M-m" 'discover-my-major)
    (:global "C-h M-S-m" 'discover-my-mode))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  "emacs-discover-my-major"

#+end_src

** TODO: calculator

~C-x * *~
  
* System management

** guix management

#+begin_src emacs-lisp

  (setup (:pkg guix)
    (setq guix-prettify-global-mode 1))

  (leader-key-def
    "G"  '(:ignore t :which-key "Guix")
    "Gg" '(guix :which-key "Guix")
    "Gp" '(guix-packages-by-name :which-key "search packages"))

#+end_src

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  "emacs-guix"

#+end_src

** TODO??: NetworkManager

some links:
[[https://github.com/tromey/emacs-network-manager]]
[[https://www.reddit.com/r/emacs/comments/dd8kth/how_to_manage_wifi_connections_with_emacs/]]
[[https://www.emacswiki.org/emacs/GnusNetworkManager]]

** TODO: StumpWM Sly

- TODO: replace =slime-lisp-mode-hook= for =sly-editing-mode= in ~lisp-mode-hook~.
#+begin_src emacs-lisp

  (setup (:pkg sly)
    (require 'sly-autoloads)
    (defun ri/stumpwm-connect ()
      (interactive)
      (sly-connect "localhost" '4004)))

#+end_src

** TODO: StumpWM-mode

#+begin_src emacs-lisp

  (setup (:pkg stumpwm-mode)
    (require 'stumpwm-mode)
    (defun ri/enable-stumpwm-mode-if-file-matches ()
      (let ((find-path (concat (getenv "HOME") "/.dotfiles/.stumpwm.d/README.org")))
        (when (and (file-exists-p find-path)
                   (equal (file-truename buffer-file-name)
                          find-path))
          (unless stumpwm-mode
            (stumpwm-mode 1)))))
    (add-to-list 'org-mode-hook #'ri/enable-stumpwm-mode-if-file-matches))

#+end_src

* TODO ALL: Org

Configuration for org-mode
Includes:
+ org-fonts
+ bullets, side-padding, tangle, toc, etc.
Syntax notes:
- you can do this! :: using "::" after a heading.

Cheatsheets:
[[https://emacsclub.github.io/html/org_tutorial.html][org -- generic tasks and syntax]]
[[https://gist.github.com/drj42/1755992][org -- expansive keybind reference card]]

** Org main config

to implement:
- break up into smaller sections (refer to daviwil guide)

#+begin_src emacs-lisp

  ;; org
  (defun ri/org-mode-setup ()
    (org-indent-mode)
    (variable-pitch-mode 1)
    (visual-line-mode 1))

  (use-package org :straight (:type built-in)
    :commands (org-capture org-agenda)
    :hook (org-mode . ri/org-mode-setup)
    :bind
    (:map org-mode-map
          ("C-M-<return>" . (lambda () (interactive)
                              (org-insert-heading-respect-content)
                              (org-demote-subtree))))
    :custom
    (org-ellipsis " ")
    (org-hide-emphasis-markers t) ; hide formatting chars (* / ~ = etc)
    (doom-modeline-enable-word-count t)
    (org-hide-leading-stars nil)
    :config
    ;; show message when loading (not necessary?)
    (message "Org Mode loaded!"))

  ;; misc
  (leader-key-def
    "o"  '(:ignore t :which-key "org")
    "ox" '(eval-last-sexp :which-key "eval-last-sexp")
    "oX" '(eval-region :which-key "eval-region"))

#+end_src

** Org-customizations

- hia
- hi

#+begin_src emacs-lisp

  (with-eval-after-load 'org
    ;; insert-mode when create new heading
    (defun ri/my--insert-heading-hook ()
      (if (eq meow-normal-mode t)
          (meow-insert-mode)))

    (setq org-insert-heading-hook '(ri/my--insert-heading-hook))

    ;; custom func for toggle heading
    (defun ri/my--toggle-heading ()
      (interactive)
      (org-back-to-heading)
      (org-cycle))

    ;; hydra for navigation
    (defhydra ri/hydra-org-navigation (:timeout 60)
      ;; heading navigation
      ("n" org-next-visible-heading "next")     ; C-c C-n
      ("p" org-previous-visible-heading "prev") ; C-c C-p 
      ("t" org-previous-visible-heading "prev") ; C-c C-p
      ;; 
      ("f" org-forward-heading-same-level "forward")   ; C-c C-f
      ("b" org-backward-heading-same-level "backward") ; C-c C-b
      ("s" org-forward-heading-same-level "forward")   ; C-c C-f
      ("h" org-backward-heading-same-level "backward") ; C-c C-b
      ;;
      ("u" outline-up-heading "up") ; C-c C-u
      ("d" outline-up-heading "up") ; C-c C-u
      ;; heading move
      ("H" org-metaleft "metaleft") ; <-
      ("T" org-metaup "metaup") ; ^^
      ("P" org-metaup "metaup") ; ^^
      ("N" org-metadown "metadown") ; v
      ("S" org-metaright "metaright") ; ->
      ;; page navigation
      ("j" ri/scroll-down-half-page "half down")
      ("k" ri/scroll-up-half-page "half up")
      ("/" ri/scroll-down-half-page "half down")
      ("?" ri/scroll-up-half-page "half up")
      ;;
      ("v" scroll-up-command "page up")
      ("V" scroll-down-command "page down")
      ;;
      ("," beginning-of-buffer "top of page")
      ("." end-of-buffer "end of page")
      ;; single down/up cursor
      ("C-n" next-line)
      ("C-p" previous-line)
      ("C-t" previous-line)
      ;; open/close
      ("TAB" ri/my--toggle-heading "open-close")
      ("c" org-shifttab "global-cycle")
      ;;
      ("g" nil "quit" :exit t))

    (leader-key-def
      "n" '(ri/hydra-org-navigation/body :which-key "hydra-navigation"))

    )

#+end_src

** Org-fonts (funcall)

Moved to [[#org-fonts]]

#+begin_src emacs-lisp

  (ri/org-font-setup)

#+end_src

