dotfiles/emacs-old/.config/oldmacs.d/init.el

;; helpful (improves help menu)
(use-package helpful
  :commands (helpful-callable helpful-variable helpful-command helpful-key)
  :custom
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-variable)
  :bind ;; change the function of the command
  ([remap describe-function] . counsel-describe-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . counsel-describe-variable)
  ([remap describe-key] . helpful-key)
  ("C-h M" . which-key-show-major-mode)
  ("C-h h" . helpful-at-point)
  ("C-h E" . describe-keymap))

(leader-key-def
  "sh" 'helpful-at-point
  "sv" 'describe-variable
  "sf" 'describe-function
  "sk" 'describe-key
  "sM" 'which-key-show-major-mode
  "sm" 'describe-mode
  "sR" 'info-display-manual
  "sP" 'describe-package)

(use-package info
  :bind
  (:map Info-mode-map
        ("j" . Info-scroll-down)
        ("S-SPC" . Info-scroll-up)
        ("v" . Info-scroll-up)
        ("k" . Info-scroll-up)))



(setup (:pkg darkroom)
  (:global "C-c s D" #'darkroom-tentative-mode))

(setup (:pkg dashboard)
  (require 'dashboard)
  ;; Do this manually instead.
  ;; (dashboard-setup-startup-hook)
  (when (or (< (length command-line-args) 2) ; >
  	  ri/exwm-enabled)
    (add-hook 'after-init-hook (lambda ()
  			       ;; Display useful lists of items
  			       (dashboard-insert-startupify-lists)))
    (add-hook 'emacs-startup-hook (lambda ()
                                    (switch-to-buffer dashboard-buffer-name)
                                    (goto-char (point-min))
                                    (redisplay)
                                    (run-hooks 'dashboard-after-initialize-hook)))))

(use-package fireplace)

(setup (:pkg discover-my-major)
  (:global "C-h M-m" 'discover-my-major)
  (:global "C-h M-S-m" 'discover-my-mode))

(setup (:pkg guix))

(leader-key-def
  "G"  '(:ignore t :which-key "Guix")
  "Gg" '(guix :which-key "Guix")
  "Gp" '(guix-packages-by-name :which-key "search packages"))

(setup (:pkg sly)
  (require 'sly-autoloads)
  (defun ri/stumpwm-connect ()
    (interactive)
    (sly-connect "localhost" '4004)))

(setup (:pkg stumpwm-mode)
  (require 'stumpwm-mode)
  (defun ri/enable-stumpwm-mode-if-file-matches ()
    (let ((find-path (concat (getenv "HOME") "/.dotfiles/.stumpwm.d/README.org")))
      (when (and (file-exists-p find-path)
                 (equal (file-truename buffer-file-name)
                        find-path))
        (unless stumpwm-mode
          (stumpwm-mode 1)))))
  (add-to-list 'org-mode-hook #'ri/enable-stumpwm-mode-if-file-matches))

;; org
(defun ri/org-mode-setup ()
  (org-indent-mode)
  (variable-pitch-mode 1)
  (visual-line-mode 1))

(use-package org :straight (:type built-in)
  :commands (org-capture org-agenda)
  :hook (org-mode . ri/org-mode-setup)
  :bind
  (:map org-mode-map
        ("C-M-<return>" . (lambda () (interactive)
                            (org-insert-heading-respect-content)
                            (org-demote-subtree))))
  :custom
  (org-ellipsis " ▼")
  (org-hide-emphasis-markers t) ; hide formatting chars (* / ~ = etc)
  (doom-modeline-enable-word-count t)
  (org-hide-leading-stars nil)
  :config
  ;; show message when loading (not necessary?)
  (message "Org Mode loaded!"))

;; misc
(leader-key-def
  "o"  '(:ignore t :which-key "org")
  "ox" '(eval-last-sexp :which-key "eval-last-sexp")
  "oX" '(eval-region :which-key "eval-region"))

(with-eval-after-load 'org
  ;; insert-mode when create new heading
  (defun ri/my--insert-heading-hook ()
    (if (eq meow-normal-mode t)
        (meow-insert-mode)))

  (setq org-insert-heading-hook '(ri/my--insert-heading-hook))

  ;; custom func for toggle heading
  (defun ri/my--toggle-heading ()
    (interactive)
    (org-back-to-heading)
    (org-cycle))

  ;; hydra for navigation
  (defhydra ri/hydra-org-navigation (:timeout 60)
    ;; heading navigation
    ("n" org-next-visible-heading "next")     ; C-c C-n
    ("p" org-previous-visible-heading "prev") ; C-c C-p 
    ("t" org-previous-visible-heading "prev") ; C-c C-p
    ;; 
    ("f" org-forward-heading-same-level "forward")   ; C-c C-f
    ("b" org-backward-heading-same-level "backward") ; C-c C-b
    ("s" org-forward-heading-same-level "forward")   ; C-c C-f
    ("h" org-backward-heading-same-level "backward") ; C-c C-b
    ;;
    ("u" outline-up-heading "up") ; C-c C-u
    ("d" outline-up-heading "up") ; C-c C-u
    ;; heading move
    ("H" org-metaleft "metaleft") ; <-
    ("T" org-metaup "metaup") ; ^^
    ("P" org-metaup "metaup") ; ^^
    ("N" org-metadown "metadown") ; v
    ("S" org-metaright "metaright") ; ->
    ;; page navigation
    ("j" ri/scroll-down-half-page "half down")
    ("k" ri/scroll-up-half-page "half up")
    ("/" ri/scroll-down-half-page "half down")
    ("?" ri/scroll-up-half-page "half up")
    ;;
    ("v" scroll-up-command "page up")
    ("V" scroll-down-command "page down")
    ;;
    ("," beginning-of-buffer "top of page")
    ("." end-of-buffer "end of page")
    ;; single down/up cursor
    ("C-n" next-line)
    ("C-p" previous-line)
    ("C-t" previous-line)
    ;; open/close
    ("TAB" ri/my--toggle-heading "open-close")
    ("c" org-shifttab "global-cycle")
    ;;
    ("g" nil "quit" :exit t))

  (leader-key-def
    "n" '(ri/hydra-org-navigation/body :which-key "hydra-navigation"))

  )

(ri/org-font-setup)
