dotfiles/emacs-old/.config/oldmacs.d/Emacs.org
** import ri-workflow

#+begin_src emacs-lisp

  (require 'ri-workflow)

#+end_src

*Keybinds:*

#+begin_src emacs-lisp

  ;; keybinds! -----

  ;; mostly just an example
  ;; (define-key global-map (kbd "C-c j")
  ;;   (lambda () (interactive) (org-capture nil "jj")))

  ;; org-agenda leader keybinds (create a separate section?
  (leader-key-def
    "oA"  '(org-agenda-list :which-key "org-agenda-schedule")
    "oc" '(org-capture :which-key "org-capture")
    "oa"  '(:ignore t :which-key "org-agenda")
    "oaa" '(org-agenda :which-key "agenda-commands")
    "oas" '(org-agenda-list :which-key "agenda-schedule")
    "oat" '(org-todo-list :which-key "todo-list")
    "oar" '(org-refile :which-key "org-refile") ; put refile in org-mode-map?
    "od"  '(org-deadline :which-key "deadline")
    "os"  '(org-schedule :which-key "schedule")
    "o."  '(org-time-stamp :which-key "time-stamp")
    "o,"  '(org-priority :which-key "priority")
    "ot" '(org-todo :which-key "todo state set")
    "oq" '(org-set-tags-command :which-key "set tags menu")
    "oQ" '(counsel-org-tag :which-key "set tags list menu")
    "op" '(org-set-property :which-key "set property")
    "oe" '(org-set-effort :which-key "set effort")
    ;; for tag multi-add alt-enter! (?)
    )

#+end_src

** Bullets

#+begin_src emacs-lisp

  (use-package org-bullets
    :hook (org-mode . org-bullets-mode)
    :custom
    (org-bullets-bullet-list '("" "" "" "" "" "" "")))

  ;; replace list hyphen with dot
  ;; (font-lock-add-keywords 'org-mode
  ;;                        '(("^ *\\([-]\\) "
  ;;                           (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) ""))))))

#+end_src

** Org-extra-emphasis

#+begin_src emacs-lisp

  ;; (use-package extra-empaisi)

#+end_src

** side-padding

#+begin_src emacs-lisp

  ;; visual-fill-mode (padding)
  (defun ri/org-mode-visual-fill ()
    (setq visual-fill-column-width 100
          ;; visual-fill-column-center-text t
          visual-fill-column-center-text t)
    (visual-fill-column-mode 1))

  (use-package visual-fill-column
    :hook (org-mode . ri/org-mode-visual-fill)
    :config
    (setq visual-fill-column-enable-sensible-window-split nil))

#+end_src

** org-babel

code blocks and stuff

*** babel languages

#+begin_src emacs-lisp

  (with-eval-after-load 'org
    (org-babel-do-load-languages
     'org-babel-load-languages
     '((emacs-lisp . t)
       (scheme . t)
       (python . t)))

    (push '("conf-unix" . conf-unix) org-src-lang-modes))

#+end_src

*** structure templates

#+begin_src emacs-lisp

  (with-eval-after-load 'org
    ;; This is needed as of Org 9.2
    (require 'org-tempo)

    (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
    (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
    (add-to-list 'org-structure-template-alist '("py" . "src python"))
    (add-to-list 'org-structure-template-alist '("scm" . "src scheme"))
    (add-to-list 'org-structure-template-alist '("unix" . "src conf-unix"))
    (add-to-list 'org-structure-template-alist '("conf" . "src conf"))
    (add-to-list 'org-structure-template-alist '("clang" . "src c"))
    (add-to-list 'org-structure-template-alist '("gcc" . "src c"))
    (add-to-list 'org-structure-template-alist '("cl" . "src common-lisp"))
    (add-to-list 'org-structure-template-alist
                 '("mani" . "src scheme :noweb-ref packages :noweb-sep \"\"")))

#+end_src

*** auto-tangle

#+begin_src emacs-lisp

  ;; tangle using #+auto_tangle: t
  (use-package org-auto-tangle
    :defer t
    :hook (org-mode . org-auto-tangle-mode))

  ;; org-babel (tangle n stuff)
  ;; Automatically tangle our Emacs.org config file when we save it
  ;; (defun ri/org-babel-tangle-config ()
  ;;   (when (string-equal (file-name-directory (buffer-file-name))
  ;;                       (expand-file-name user-emacs-directory))

      ;; ;; Dynamic scoping to the rescue
      ;; (let ((org-confirm-babel-evaluate nil))
      ;;   (org-babel-tangle))))

  ;; (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'ri/org-babel-tangle-config)))

  (leader-key-def
    "ob"  '(:ignore t :which-key "org-babel")
    "obt" '(org-babel-tangle :which-key "tangle")
    "obe" '(org-babel-execute-src-block :which-key "org-babel-execute-src-block"))

#+end_src

** TOC

https://github.com/snosov1/toc-org

#+begin_src emacs-lisp

  (use-package toc-org
    :hook (org-mode . toc-org-mode))

#+end_src

** TODO: org-roam

use ~straight: t~ instead if error?

#+begin_src emacs-lisp

  (setup (:pkg org-roam :straight t)
    (let ((dir (file-truename "~/Notes/Roam")))
      (unless (file-directory-p dir)
        (f-mkdir-full-path dir))
      (setq org-roam-directory dir))
    (add-hook 'after-init #'org-roam-mode)
    (:with-map org-roam-mode-map
      (:bind "C-c n l" org-roam-buffer-toggle
             "C-c n f" org-roam-node-find
             "C-c n g" org-roam-graph
             "C-c n i" org-roam-node-insert
             "C-c n c" org-roam-capture
             ;; Dailies
             "C-c n j" org-roam-dailies-caputre-today))
    ;; for vertical completion framework
    (setq org-roam-node-display-template
  	(concat "${title:*} " (propertize "${tags:10}" 'face 'org-tag)))
    (org-roam-db-autosync-mode)
    ;; If using org-roam-protocol
    ;; (require 'org-roam-protocol)
    )

#+end_src

*Guix Package*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  "emacs-org-roam"
  "emacs-sqlite"
  "emacs-sqlite3-api" ; better, but still broken! use downloader?

#+end_src

** LaTeX

[[https://github.com/fuxialexander/emacs-webkit-katex-render][Webkit LaTeX function preview renderer - Github]]

#+begin_src emacs-lisp

  (leader-key-def
    "oL" 'org-latex-export-to-pdf)

#+end_src

** Typographic symbols (problematic?)

[[https://github.com/jorgenschaefer/typoel][Github - typo.el]]

this changes: dashes, quotes, backticks, arrows.

=C-c 8= to access most of it.

enable typo-mode in org buffers that I choose?

Ask someone: Is there a way to enable a minor mode when in a specified org file, in the form of an org header argument? (something like ~#+EVAL: (typo-mode 1)~)

is this too invasive? will it mess things up?


#+begin_src emacs-lisp

  (setup (:pkg typo)
    (typo-global-mode 1))

#+end_src

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  "emacs-typo"

#+end_src

** ledger-mode

[[https://github.com/ledger/ledger-mode][ledger-mode - Github]]
[[https://github.com/narendraj9/hledger-mode][hledger-mode - Github]]

** Color picker

[[https://github.com/osener/emacs-webkit-color-picker/tree/master][Webkit Color Picker - Github]]

** Pomodoro timer

#+begin_src emacs-lisp

  (use-package org-pomodoro
    :bind ("C-c o P" . org-pomodoro))

#+end_src

** TODO Org-Download

https://github.com/abo-abo/org-download

~org-download-yank~
~org-download-screenshot~ (command not yet set up)
- after downloading image with org-download, change the date metadata to something like 2000?

#+begin_src emacs-lisp

  (use-package org-download
    ;; :config
    ;; (setq org-download-screenshot-method "") ; only supports scrot, gm, and xclip.
    )

#+end_src

** TODO: Markdown

#+begin_src emacs-lisp

  (setup markdown-mode
    (:hook visual-line-mode))

#+end_src

* TODO ALL: Development

** language servers

NOTE: will lag if too many MAIN files in a dir!!!!!

#+begin_src emacs-lisp

  ;; if nil, use eglot if possible
  ;; (setq ri/prefer-eglot-mode t)
  (setq ri/prefer-eglot-mode nil)

#+end_src

