dotfiles/emacs-old/.config/oldmacs.d/init.el

(require 'ri-workflow)

;; keybinds! -----

;; mostly just an example
;; (define-key global-map (kbd "C-c j")
;;   (lambda () (interactive) (org-capture nil "jj")))

;; org-agenda leader keybinds (create a separate section?
(leader-key-def
  "oA"  '(org-agenda-list :which-key "org-agenda-schedule")
  "oc" '(org-capture :which-key "org-capture")
  "oa"  '(:ignore t :which-key "org-agenda")
  "oaa" '(org-agenda :which-key "agenda-commands")
  "oas" '(org-agenda-list :which-key "agenda-schedule")
  "oat" '(org-todo-list :which-key "todo-list")
  "oar" '(org-refile :which-key "org-refile") ; put refile in org-mode-map?
  "od"  '(org-deadline :which-key "deadline")
  "os"  '(org-schedule :which-key "schedule")
  "o."  '(org-time-stamp :which-key "time-stamp")
  "o,"  '(org-priority :which-key "priority")
  "ot" '(org-todo :which-key "todo state set")
  "oq" '(org-set-tags-command :which-key "set tags menu")
  "oQ" '(counsel-org-tag :which-key "set tags list menu")
  "op" '(org-set-property :which-key "set property")
  "oe" '(org-set-effort :which-key "set effort")
  ;; for tag multi-add alt-enter! (?)
  )

(use-package org-bullets
  :hook (org-mode . org-bullets-mode)
  :custom
  (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))

;; replace list hyphen with dot
;; (font-lock-add-keywords 'org-mode
;;                        '(("^ *\\([-]\\) "
;;                           (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

;; (use-package extra-empaisi)

;; visual-fill-mode (padding)
(defun ri/org-mode-visual-fill ()
  (setq visual-fill-column-width 100
        ;; visual-fill-column-center-text t
        visual-fill-column-center-text t)
  (visual-fill-column-mode 1))

(use-package visual-fill-column
  :hook (org-mode . ri/org-mode-visual-fill)
  :config
  (setq visual-fill-column-enable-sensible-window-split nil))

(with-eval-after-load 'org
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (scheme . t)
     (python . t)))

  (push '("conf-unix" . conf-unix) org-src-lang-modes))

(with-eval-after-load 'org
  ;; This is needed as of Org 9.2
  (require 'org-tempo)

  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("py" . "src python"))
  (add-to-list 'org-structure-template-alist '("scm" . "src scheme"))
  (add-to-list 'org-structure-template-alist '("unix" . "src conf-unix"))
  (add-to-list 'org-structure-template-alist '("conf" . "src conf"))
  (add-to-list 'org-structure-template-alist '("clang" . "src c"))
  (add-to-list 'org-structure-template-alist '("gcc" . "src c"))
  (add-to-list 'org-structure-template-alist '("cl" . "src common-lisp"))
  (add-to-list 'org-structure-template-alist
               '("mani" . "src scheme :noweb-ref packages :noweb-sep \"\"")))

;; tangle using #+auto_tangle: t
(use-package org-auto-tangle
  :defer t
  :hook (org-mode . org-auto-tangle-mode))

;; org-babel (tangle n stuff)
;; Automatically tangle our Emacs.org config file when we save it
;; (defun ri/org-babel-tangle-config ()
;;   (when (string-equal (file-name-directory (buffer-file-name))
;;                       (expand-file-name user-emacs-directory))

    ;; ;; Dynamic scoping to the rescue
    ;; (let ((org-confirm-babel-evaluate nil))
    ;;   (org-babel-tangle))))

;; (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'ri/org-babel-tangle-config)))

(leader-key-def
  "ob"  '(:ignore t :which-key "org-babel")
  "obt" '(org-babel-tangle :which-key "tangle")
  "obe" '(org-babel-execute-src-block :which-key "org-babel-execute-src-block"))

(use-package toc-org
  :hook (org-mode . toc-org-mode))

(setup (:pkg org-roam :straight t)
  (let ((dir (file-truename "~/Notes/Roam")))
    (unless (file-directory-p dir)
      (f-mkdir-full-path dir))
    (setq org-roam-directory dir))
  (add-hook 'after-init #'org-roam-mode)
  (:with-map org-roam-mode-map
    (:bind "C-c n l" org-roam-buffer-toggle
           "C-c n f" org-roam-node-find
           "C-c n g" org-roam-graph
           "C-c n i" org-roam-node-insert
           "C-c n c" org-roam-capture
           ;; Dailies
           "C-c n j" org-roam-dailies-caputre-today))
  ;; for vertical completion framework
  (setq org-roam-node-display-template
      (concat "${title:*} " (propertize "${tags:10}" 'face 'org-tag)))
  (org-roam-db-autosync-mode)
  ;; If using org-roam-protocol
  ;; (require 'org-roam-protocol)
  )

(leader-key-def
  "oL" 'org-latex-export-to-pdf)

(setup (:pkg typo)
  (typo-global-mode 1))

(use-package org-pomodoro
  :bind ("C-c o P" . org-pomodoro))

(use-package org-download
  ;; :config
  ;; (setq org-download-screenshot-method "") ; only supports scrot, gm, and xclip.
  )

(setup markdown-mode
  (:hook visual-line-mode))

;; if nil, use eglot if possible
;; (setq ri/prefer-eglot-mode t)
(setq ri/prefer-eglot-mode nil)
