dotfiles/emacs-old/.config/oldmacs.d/Emacs.org
*** lsp-mode

https://emacs-lsp.github.io/lsp-mode/

https://emacs-lsp.github.io/lsp-ui/

Eldoc mode provides signature info and such in minibuffer when hover over.

Cool commands:
- lsp-find-definition
- lsp-find-references
  - lsp-ui-peek-find-references
  - lsp-treemacs-references
- lsp-rename
- flymake-show-buffer-diagnostics
- lsp-execute-code-actions
- lsp-format-buffer
- lsp-ui-doc-focus-frame
- lsp-ivy-workspace-symbol
  - lsp-ivy-global-workspace-symbol
- lsp-treemacs-symbols

#+begin_src emacs-lisp

  (setup (:pkg lsp-mode)
    ;; (:bind "TAB" completion-at-point)
    (:option lsp-headerline-breadcrumb-enable nil
             lsp-keymap-prefix "C-c l"
             lsp-clients-clangd-executable (executable-find "clangd")
             ;; reduce flashiness
             lsp-eldoc-render-all nil ; all info in minibuffer
             lsp-enable-symbol-highlighting t ; highlight repeated symbols
             lsp-symbol-highlighting-skip-current t ; skip current symbol when highlighting
             ;;
             lsp-inlay-hint-enable t ; ???
             ;; fixes yasnippet last bracket behavior
             lsp-enable-relative-indentation t
             )

    (setq lsp-idle-delay 0.1) ; set unique for each lang mode?

    (:when-loaded
      (progn
       (global-set-key (kbd "C-c l") lsp-command-map) ; to get Meow space to work
       (lsp-enable-which-key-integration)
       ))

    (leader-key-def
      "l" '(:ignore t :which-key "lsp")
      "lx" '(:ignore t :which-key "xref")
      "lxd" 'xref-find-definitions
      "lxr" 'xref-find-references
      "ln" 'lsp-ui-find-next-reference
      "lp" 'lsp-ui-find-prev-reference
      "ls" 'counsel-imenu
      "le" 'lsp-ui-flycheck-list
      "lS" 'lsp-ui-sideline-mode
      "lX" 'lsp-execute-code-action))

  (setup (:pkg lsp-ui)
    (:hook-into lsp-mode)
    (:when-loaded
      (progn
        (setq lsp-ui-sideline-enable t) ; enable lsp-ui sideline
        (setq lsp-ui-sideline-show-hover nil) ; hover mesgs in sideline
        (setq lsp-ui-doc-position 'bottom) ; position of prev setting
        (setq lsp-ui-doc-show-with-cursor nil) ; show documentation when hover over
        (lsp-ui-doc-show))))

#+end_src

**** lsp-treemacs

provides alternative tree-view visualization for lsp

#+begin_src emacs-lisp

  ;; (use-package lsp-treemacs
  ;;   :after lsp-mode)

#+end_src

**** lsp-ivy

special ivy search functionality for lsp
+ lsp-ivy-workspace-symbol

#+begin_src emacs-lisp

  ;; (use-package lsp-ivy
  ;;   :after lsp-mode)

#+end_src

**** ivy-xref

#+begin_src emacs-lisp

  ;; (use-package ivy-xref
  ;;   :init
  ;;   (when (>= emacs-major-version 27) ; < to fix meow-block
  ;;     (setq xref-show-definitions-function #'ivy-xref-show-defs)))

#+end_src

*** eglot

#+begin_src emacs-lisp

  (use-package eglot)

  ;; (setup (:pkg eglot)
  ;;   ;; TODO: Don't load until needed
  ;;   (require 'eglot)
  ;;   ;; (define-key eglot-mode-map (kbd "C-c C-a") #'eglot-code-actions)
  ;;   ;; (define-key eglot-mode-map (kbd "C-c C-r") #'eglot-rename)
  ;;   ;; (setq eglot-autoshutdown t
  ;;   ;;       ;; eglot-confirm-server-edits nil
  ;;         ;; )
  ;;   )

#+end_src

** languages

*** TODO: general lisp (paredit) (copy over docs)

[[http://danmidwood.com/content/2014/11/21/animated-paredit.html][Paredit - Visual demonstration]]

[[https://mumble.net/~campbell/emacs/paredit.html][Paredit Cheetsheet - basic html]]

|------------+----------+------------+----------|
| Paredit:   |          |            |          |
|------------+----------+------------+----------|
| Navigation | Wrapping | Slurp/barf | Splice   |
|------------+----------+------------+----------|
| C-M-f      | M-(      | C-)        | M-<up>   |
| C-M-b      | M-"      | C-}        | M-<down> |
| C-M-u      |          | C-(        | M-s      |
| )  next    |          | C-{        | M-S      |
|------------+----------+------------+----------|

HOLY SHIT Paredit is insane, i never have to use other navigation keys ever again... only paredit keybinds, main, can do just that.

- [ ] wrap s-expr :: ~M-(~ :  ~M-"~ 

- Split s-expr :: ~M-S~
- Join s-expr :: ~M-J~

- Splice down (kill forwards all s-expr in list, and bring up) :: ~M<down>~
- Splice up (kill backwards all s-expr in list, and bring up) :: ~M-<up>~
- Splice list/s-expr :: ~M-s~

- Slurp (pull in next s-expr after current list) :: ~C-)~ / backwards: ~C-(~
- Barf (push out last s-expr into next list) :: ~C-}~ / backwards: ~C-{~

- Forward down (list into-next) :: ~C-M-d~ :go to end of list, go deeper into next list.
- Backward up (list back-out) :: ~C-M-u~ :go to beginning of list, go out backwards into previous list.
- Forward up out (of current list) :: ~C-M-n~ :go to end of this list and go out.
- Backward down into (prev list) :: ~C-M-p~ :if at end of list, go backwards and into previous list
- Forward s-expr :: ~C-M-f~ :go to end of list, go to next s-expr
- Backward s-expr :: ~C-M-b~ :go to beginning of list, go to prev s-expr, if no more, go up and out one.

- move to next closing paren :: ~)~

- misc: ~C-M-@~ (mark-sexp), ~C-M-t~ (transpose-sexp)

#+begin_src emacs-lisp

  (setup (:pkg paredit)
    (:hook-into emacs-lisp-mode scheme-mode)
    (:bind "M-r" nil)) ; originally `paredit-raise-sexp'

  ;; (setup (:pkg lispy))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  "emacs-paredit"

#+end_src

*** TODO folding lisp code

#+begin_src emacs-lisp :tangle no

  (setup outline
    (:with-map outline-minor-mode-map
      (:bind "M-<iso-lefttab>" outline-cycle
             "<backtab>" outline-cycle-buffer))
    (defun outline-minor-mode-startup ()
      (when outline-minor-mode
        (and (hide-sublevels (if (eq outline-level 'lisp-outline-level) 100 1))
             'nil
             )))
    (add-hook 'outline-minor-mode-hook #'outline-minor-mode-startup))

#+end_src

*** TODO emacs-lisp

Note: If Guile is not installed, then an error saying =cannot find guile implementation= may show. 

#+begin_src emacs-lisp

  ;; broken?
  (use-package flycheck)
  (add-hook 'emacs-lisp-mode-hook #'flycheck-mode) ; make sure flycheck is installed first!

  (define-key emacs-lisp-mode-map (kbd "C-M--") #'completion-at-point)

  ;; auto correct comment length
  (progn
    (auto-fill-mode 1)
    (require 'newcomment)
    (setq comment-auto-fill-only-comments t))

  (leader-key-def
    "ol" 'org-lint)

  (setup org
    (:global "C-c e m" emacs-lisp-macroexpand))

#+end_src

*** Scheme

#+begin_src emacs-lisp

  ;; Include .sld library definition files
  (setup scheme-mode
    (:file-match "\\.sld\\'")
    (:hook guix-devel-mode))

  (setup (:pkg geiser)
    (setq geiser-default-implementation 'guile)
    (setq geiser-active-implementations '(guile))
    (setq geiser-implementations-alist '(((regexp "\\.scm$") guile))))

  (setup (:pkg geiser-guile))

  (add-hook 'scheme-mode-hook #'flycheck-mode)

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  "emacs-geiser"

#+end_src

*** Common Lisp

#+begin_src emacs-lisp

  (use-package slime)

#+end_src

