dotfiles/emacs-old/.config/oldmacs.d/init.el

(setup (:pkg lsp-mode)
  ;; (:bind "TAB" completion-at-point)
  (:option lsp-headerline-breadcrumb-enable nil
           lsp-keymap-prefix "C-c l"
           lsp-clients-clangd-executable (executable-find "clangd")
           ;; reduce flashiness
           lsp-eldoc-render-all nil ; all info in minibuffer
           lsp-enable-symbol-highlighting t ; highlight repeated symbols
           lsp-symbol-highlighting-skip-current t ; skip current symbol when highlighting
           ;;
           lsp-inlay-hint-enable t ; ???
           ;; fixes yasnippet last bracket behavior
           lsp-enable-relative-indentation t
           )

  (setq lsp-idle-delay 0.1) ; set unique for each lang mode?

  (:when-loaded
    (progn
     (global-set-key (kbd "C-c l") lsp-command-map) ; to get Meow space to work
     (lsp-enable-which-key-integration)
     ))

  (leader-key-def
    "l" '(:ignore t :which-key "lsp")
    "lx" '(:ignore t :which-key "xref")
    "lxd" 'xref-find-definitions
    "lxr" 'xref-find-references
    "ln" 'lsp-ui-find-next-reference
    "lp" 'lsp-ui-find-prev-reference
    "ls" 'counsel-imenu
    "le" 'lsp-ui-flycheck-list
    "lS" 'lsp-ui-sideline-mode
    "lX" 'lsp-execute-code-action))

(setup (:pkg lsp-ui)
  (:hook-into lsp-mode)
  (:when-loaded
    (progn
      (setq lsp-ui-sideline-enable t) ; enable lsp-ui sideline
      (setq lsp-ui-sideline-show-hover nil) ; hover mesgs in sideline
      (setq lsp-ui-doc-position 'bottom) ; position of prev setting
      (setq lsp-ui-doc-show-with-cursor nil) ; show documentation when hover over
      (lsp-ui-doc-show))))

;; (use-package lsp-treemacs
;;   :after lsp-mode)

;; (use-package lsp-ivy
;;   :after lsp-mode)

;; (use-package ivy-xref
;;   :init
;;   (when (>= emacs-major-version 27) ; < to fix meow-block
;;     (setq xref-show-definitions-function #'ivy-xref-show-defs)))

(use-package eglot)

;; (setup (:pkg eglot)
;;   ;; TODO: Don't load until needed
;;   (require 'eglot)
;;   ;; (define-key eglot-mode-map (kbd "C-c C-a") #'eglot-code-actions)
;;   ;; (define-key eglot-mode-map (kbd "C-c C-r") #'eglot-rename)
;;   ;; (setq eglot-autoshutdown t
;;   ;;       ;; eglot-confirm-server-edits nil
;;         ;; )
;;   )

(setup (:pkg paredit)
  (:hook-into emacs-lisp-mode scheme-mode)
  (:bind "M-r" nil)) ; originally `paredit-raise-sexp'

;; (setup (:pkg lispy))

;; broken?
(use-package flycheck)
(add-hook 'emacs-lisp-mode-hook #'flycheck-mode) ; make sure flycheck is installed first!

(define-key emacs-lisp-mode-map (kbd "C-M--") #'completion-at-point)

;; auto correct comment length
(progn
  (auto-fill-mode 1)
  (require 'newcomment)
  (setq comment-auto-fill-only-comments t))

(leader-key-def
  "ol" 'org-lint)

(setup org
  (:global "C-c e m" emacs-lisp-macroexpand))

;; Include .sld library definition files
(setup scheme-mode
  (:file-match "\\.sld\\'")
  (:hook guix-devel-mode))

(setup (:pkg geiser)
  (setq geiser-default-implementation 'guile)
  (setq geiser-active-implementations '(guile))
  (setq geiser-implementations-alist '(((regexp "\\.scm$") guile))))

(setup (:pkg geiser-guile))

(add-hook 'scheme-mode-hook #'flycheck-mode)

(use-package slime)
