dotfiles/emacs-old/.config/oldmacs.d/Emacs.org
*** Rust

[[https://emacs-lsp.github.io/lsp-mode/page/lsp-rust-analyzer/][Rust-analyzer documentation]]

[[https://github.com/brotzeit/rustic][Rustic documentation - Github]]
[[https://github.com/brotzeit/rustic#org-babel][Rustic documentation - write all code in Org babel - Github]]
[[https://github.com/brotzeit/rustic#rust-docs-in-org-mode][Rustic documentation - read all rust docs in org-mode - Github]]

[[https://robert.kra.hn/posts/rust-emacs-setup/][Blog - rustic-emacs setup guide]]
[[https://github.com/rksm/emacs-rust-config/blob/ec562f005152fabba0447ce64687cbb572a7d49b/init.el][Blog - rustic-emacs setup guide - Example config]]

[[https://emacs-lsp.github.io/dap-mode/page/configuration/#rust][Dap-mode docs - Rust]]

- Things to implement:
  - consider ~M-u~ as a keybind for ~lsp-execute-code-action~
  - lsp and rust uses too much cpu and power
    (sometimes... maybe project dependent? maybe broken/not configured properly?)

Note: most rustic features are accessible with C-c C-c

- Control Panel (popup)
  - ~C-c C-p~ :: control-panel (rustic-popup)
- Code Navigation
  - ~M-.~ :: jump to definition (source code)
  - ~M-,~ :: jump back
  - ~M-j~ :: toc emum/impl
- Code Actions
  - ~C-c C-c R~ :: rename
  - ~C-c C-c g/a~ :: code-actions
  - ~C-c C-c e~ :: macro expand
- Code Completion and snippets
  - ~C-c C-c l~ :: list errors
- Cargo-edit
  - ~add/rm/upgrade/update/outdated~ :: misc.
- Run
  - ~C-c C-c C-c~ :: run current test
- Inline Type Hints
  - might not interact well with lsp-ui-sideline-mode, but we'll see.

#+begin_src emacs-lisp

  ;; rust-analyzer required. gnu guix package?
  (use-package rustic
    ;; ensure t ;; no need *
    :hook (rust-mode . lsp-deferred)
    :bind (:map rustic-mode-map
                ("M-j" . lsp-ui-imenu)
                ("M-?" . lsp-find-references) ; overwrites xref-find-references
                ("C-M-c" . lsp-execute-code-action)
                ("C-c C-c l" . flycheck-list-errors)
                ("C-c C-c S" . lsp-rust-analyzer-status)
                ("C-c C-c j" . lsp-rust-analyzer-join-lines)
                ("C-c C-c t" . lsp-rust-analyzer-related-tests)
                ("C-c C-c C" . lsp-rust-analyzer-open-cargo-toml)
                ("C-c C-c D" . lsp-rust-analyzer-open-external-docs)
                ("C-c C-c e" . lsp-rust-analyzer-expand-macro)
                ("C-c C-c R" . lsp-rename)
                ("C-c C-c A" . lsp-execute-code-action)
                ("C-c C-c g" . lsp-execute-code-action)
                ("C-c C-c y" . ivy-yasnippet)
                ("C-c C-c E" . dap-hydra)
                ("C-c C-c h" . lsp-ui-doc-glance)
                ("C-c C-c P" . rust-playground)
                ("C-c C-c q" . lsp-workspace-restart)
                ("C-c C-c Q" . lsp-workspace-shutdown))
    :custom
    ;; what to use when checking on-save. def "check", rec "clippy". try both.
    (lsp-rust-analyzer-cargo-watch-command "clippy")
    ;; (lsp-rust-analyzer-cargo-watch-command "check")
    (rustic-format-on-save nil)

    ;; lsp hints ----
    ;; All below controls the overlays that display type and other hints inline. Enable
    ;; / disable as you prefer. Will require a `lsp-workspace-restart' to have an
    ;; effect on open projects.
    ;; ----
    ;; Below is built-in (basically shows inferred type inline after var decl.)
    ;; (lsp-rust-analyzer-server-display-inlay-hints t) ; no symbol at point?
    ;; Elided lifetime inlay hints:
    (lsp-rust-analyzer-display-lifetime-elision-hints-enable "skip_trivial")
    ;; Inlay type hints for method chains:
    (lsp-rust-analyzer-display-chaining-hints t)
    ;; Parameter names or numeric placeholder names for lifetimes:
    (lsp-rust-analyzer-display-lifetime-elision-hints-use-parameter-names nil) ; ??
    ;; Closure return type inlay hints for closures with block bodies:
    (lsp-rust-analyzer-display-closure-return-type-hints t) ; ??
    ;; Function parameter name inlay hints at the call site:
    (lsp-rust-analyzer-display-parameter-hints t)
    ;; Inlay type hints for compiler inserted reborrows:
    (lsp-rust-analyzer-display-reborrow-hints "always")
    ;; Inlay type hints for binding modes:
    (lsp-rust-analyzer-binding-mode-hints t) ; ??

    :config
    ;; on-save features in rustic-mode
    (add-hook 'rustic-mode-hook 'ri/rustic-mode-hook))

  (defun ri/rustic-mode-hook ()
    ;; if C-c C-c C-r (run) and buffer not saved, save without prompting and run.
    ;; Doesn't fix, not a rustic issue?
    (when buffer-file-name
      (setq-local buffer-save-without-query t))
    ;; each lang will have its own value
    (setq lsp-idle-delay 0.5))


  (use-package rust-playground
    :after lsp-mode)

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  "rust"
  
#+end_src

