dotfiles/emacs-old/.config/oldmacs.d/init.el
;; if ri/prefer-elgot-mode, use ccls instead.
(dolist (mode '(c++-mode-hook
                c-mode-hook
                objc-mode-hook
                cuda-mode-hook))
  (add-hook mode (lambda ()
                   (if ri/prefer-eglot-mode
                       (progn
                         (message "set to use eglot")
                         (eglot-ensure))
                     (progn
                       (lsp-deferred)
                       (setq lsp-idle-delay 0.5))))))

(add-hook 'c-mode-hook
          (lambda ()
            ;; (c-set-style "bsd")
            ;; (setq c-basic-offset 2)
            (indent-tabs-mode 0)
            ))

(defvar ri/c-compile-inputs nil)
(defun ri/c-compile-and-run (&optional use-extra)
  (interactive)
  (unless (or (eq major-mode 'c-mode) (eq major-mode 'comint-mode))
    (error "not in c-mode or comint-mode!"))
  (let* ((main (file-name-nondirectory (buffer-file-name)))
         (exe (file-name-sans-extension main))
         (src (let ((extra-files '("leak_detector_c.c")) ; fill this up
                    (valid-files ""))
                (dolist (p (push main extra-files))
                  (if (file-exists-p
                       (file-name-concat (file-name-directory (buffer-file-name)) p))
                      (setq valid-files (concat valid-files p))))
                valid-files))
         (run-command
          (if (and use-extra ri/c-compile-inputs)
              (concat "gcc " src " -std=gnu11 -lm -o " exe " && ./" exe " && "
                      ri/c-compile-inputs)
            (concat "gcc " src " -std=gnu11 -lm -o " exe " && ./" exe))))
    (save-buffer)
    (compile run-command t) ; -lm for math.h lib
    ;; go through every window in current frame, if match comint-mode, select.
    (let ((orig-win (selected-window))
          (curr-win (next-window)))
      ;; `catch' returns 't if while-loop finds a comint buffer in frame.
      (if (eq 't (catch 'break
                   (let ((inc '0)) ; increments per window change
                     (while (not (equal orig-win curr-win))
                       (if (equal 'comint-mode
                                  (with-current-buffer ; returns value of major-mode when
                                      (window-buffer curr-win) ; on buffer of curr-win.
                                    major-mode))
                           (throw 'break t)) ; return t to `catch', found a match
                       ;; select next window
                       (setq curr-win (next-window curr-win))
                       ;; increment by 1 and err if inc value is 1000
                       (setq inc (+ inc 1))
                       (if (equal inc 1000)
                           (progn (user-error "Infinite loop!")
                                  (throw 'break nil))))
                     ;; ^end of while loop
                     (throw 'break nil)))) ; went through all windows, no match.
          (progn
            (select-window curr-win) ; found match, focus on curr-win.
            (end-of-buffer)
            ;; dont make it strongly dedicated!
            (set-window-dedicated-p (selected-window) nil)
            (if (meow-normal-mode-p)
                (meow-insert-mode)))
        (progn
          (message "%s" "could not find compilation buffer!"))))))

(define-key c-mode-map (kbd "<f8>") #'ri/c-compile-and-run)
(define-key c-mode-map (kbd "S-<f8>") (lambda () (interactive)
                                        (ri/c-compile-and-run 't)))
(define-key comint-mode-map (kbd "<f8>") #'quit-window)

;; (add-hook 'c-mode-hook
;;           (lambda ()
;;             (require 'cc-mode)
;;             (define-key c-mode-map "\C-c\M-c" #'lsp-ui-imenu)))

(with-eval-after-load 'dap-mode
  (require 'dap-cpptools) ; also for dap
  (dap-cpptools-setup)) ; for dap

;; ;; language server (alternative to clangd)
;; (use-package ccls)
;;   ;; :after lsp-mode
;;   :hook
;;   ((c-mode c++-mode objc-mode cuda-mode) . (lambda () (require 'ccls) (lsp-deferred)))
;;   :bind (:map c-mode-map
;;               ("C-c C-c" . nil)
;;               ("C-c C-c C-i" . lsp-ui-imenu))
;;   :config
;;   (with-eval-after-load dap-mode
;;     (dap-cpptools-setup) ; for dap
;;     (require 'dap-cpptools))) ; also for dap

(use-package python-mode
  ;; :ensure t ;; no need *
  :hook (python-mode . lsp-deferred)
  :custom
  ;; NOTE: Set these if Python 3 is called "python3" on your system!
  (python-shell-interpreter "python3")
  (dap-python-executable "python3")
  (dap-python-debugger 'debugpy)
  :config
  (require 'dap-python))



(with-eval-after-load 'mhtml-mode
  (define-key mhtml-mode-map (kbd "M-F") facemenu-keymap)
  (define-key mhtml-mode-map (kbd "M-o") 'nil)
  (define-key mhtml-mode-map (kbd "C-c C-v") #'ri/open-file-in-external-browser))

(use-package quickrun)

(defun ri/abort-company-and-meow-insert-exit ()
  (interactive)
  (company-abort)
  (meow-insert-exit))

(use-package company
  :hook ((eglot-server-initialized lsp-mode) . company-mode)
  :bind
  ((:map company-active-map ; disable C-n, C-p, replace with C-RET, C-M-RET?
         ("<tab>" . company-complete-selection)
         ("C-t" . company-select-previous-or-abort)
         ("C-<return>" . company-select-next)
         ("C-g" . ri/abort-company-and-meow-insert-exit)
         )
   (:map lsp-mode-map ; when in any buffer with lsp minor mode enabled
         ;; ("<tab>" . company-indent-or-complete-common) ; only indent!!!!!!
         ;; ("<tab>" . company-complete-common)
         ;; ("<tab>" . company-complete-common-or-show-delayed-tooltip)
         ;; ("<tab>" . company-complete-common-or-cycle)
         )
   (:map company-search-map
         ("C-t" . company-select-previous-or-abort)))
  :custom
  (company-minimum-prefix-length 1)
  (company-idle-delay 0.0)
  ;; fixes evil-normal and cancel company autocomplete when escape
  ;; doesn't work if escape hit very quickly
  :config
  (if ri/use-evil-mode
      (add-hook 'company-mode-hook
                (lambda ()
                  (add-hook 'evil-normal-state-entry-hook
                            (lambda ()
                              (company-abort)))))))

;; prettified company front-end with icons
(use-package company-box
  :hook (company-mode . company-box-mode))

(setup (:pkg yasnippet)
  (require 'yasnippet)
  (add-hook 'prog-mode-hook #'yas-minor-mode)
  (yas-reload-all))

(setup (:pkg yasnippet-snippets))

;; provides command ivy-yasnippet
(setup (:pkg ivy-yasnippet))

(setup (:pkg flycheck)
  (:hook-into lsp-mode))
