dotfiles/emacs-old/.config/oldmacs.d/init.el

;; check lsp-enable-dap-auto-configure if enabled
(use-package dap-mode
  :after lsp-mode
  :config
  (message "DEBUG: THIS SHOULD SHOW!")
  ;; (setq dap-auto-configure-mode) ; def t
  ;; (dap-ui-mode 1) ; below uncomment if prev custom var is nil
  ;; (dap-tooltip-mode 1)
  ;; (require 'dap-node)
  ;; (dap-node-setup)

  ;; Rust debugger ----
  (require 'dap-lldb)
  (require 'dap-gdb-lldb)
  ;; installs vscode extension
  ;; (more info: https://robert.kra.hn/posts/rust-emacs-setup/)
  ;; list errors and fixes here:
  (dap-gdb-lldb-setup)
  (dap-register-debug-template "Rust::GDB Run Configuration"
                               (list :type "gdb"
                                     :request "launch"
                                     :name "GDB::Run"
                                     :gdbpath "rust-gdb"
                                     :target nil
                                     :cwd nil)))

;; projectile
;; (project management)
;; (bound to C-p)
;; (dir-locals are pretty cool)
;; (learn more about projectile for better project management)
(use-package projectile
  :diminish projectile-mode
  :config
  (define-key projectile-mode-map (kbd "C-c p") 'projectile-command-map)
  (projectile-mode)
  :custom ((projectile-completion-system 'ivy)) ;; by default auto
  ;; :bind-keymap
  ;; ("C-c p" . projectile-command-map)
  :init
  (when (file-directory-p "~/Code/code")
    (setq projectile-project-search-path '("~/Code/code")))
  (setq projectile-switch-project-action #'projectile-dired))

;; counsel-projectile
;; (more options in M-o... already installed?)
;; (counsel-projectile-rg + M-o for a massive search in project)
(use-package counsel-projectile
  :after projectile
  :config (counsel-projectile-mode))

(use-package compile
  :ensure nil ; make sure use-package doesn't compile it
  :straight nil
  :custom
  (compilation-scroll-output t))

(use-package aggressive-indent
  :defer t
  :config
  (add-hook 'emacs-lisp-mode-hook #'aggressive-indent-mode))

(use-package smartparens
  :hook (prog-mode . smartparens-mode))

;; (use-package evil-nerd-commenter
;;   :disabled
;;   :custom
;;   (evil-want-keybinding nil)
;;   :bind ("M-/" . evilnc-comment-or-uncomment-lines))

(global-set-key (kbd "M-/") 'meow-comment)

(global-prettify-symbols-mode 1)

;;; crdt.el
;;; Explanation by Ari Wari :3
;; -----------------------------
;;; Host: ----
;; - Run M-x `crdt-share-buffer' to create a shared session if not already
;; exists, and add the current buffer (file) to the list of shared buffers in
;; the session. In the menu presented when creating a new shared session, you
;; can specify a password, display name, and client permissions. The other
;; settings can be left as default. (Experimental feature: You can also specify
;; a TLS port under "Secure port" if you want to use that protocol. You can also
;; set the variable `crdt-default-tls' to `t' down below to have it always
;; be enabled by default.)
;;
;;; Client: ----
;; - Run M-x `crdt-connect', which will prompt for an address, port, and your
;; display name.
;;
;;--------
;; + NOTE: in most list interfaces, you can press 'k' or 'd' to
;; remove/kill/disconnect them.
;;----------
;;
;;; Sessions: ----
;; - List active sessions with M-x `crdt-list-sessions'.
;;  - (Terminate session:
;;      'k'/'d' in list, or
;;      (host: M-x `crdt-stop-session')
;;      (client: M-x `crdt-disconnect'))
;;
;;; Buffers: ----
;; - List shared buffers with M-x `crdt-list-buffers'. Navigate and press 'RET'
;; to go to that buffer.
;;  - (Remove buffer from session: 
;;      'k'/'d' in list, or M-x `crdt-stop-share-buffer'.)
;; - M-x `crdt-share-buffer' to add your own local buffers to the
;; list of shared buffers.
;;
;;; Users: ----
;; - List active users with M-x `crdt-list-users'. Navigate to and press 'RET'
;; to go to their current cursor position. Press 'f' to follow that user, and
;; press 'f' again to detach.
;; - M-x `crdt-goto-next-user' and `crdt-goto-prev-user' to cycle through
;; users' cursor positions, from any shared buffer.
;;
;;; Quitting: ----
;; - The host can terminate the session by running M-x `crdt-stop-session'.
;; - The client can disconnect from a session with M-x `crdt-disconnect'.
;;
;;; Fancy stuff: ----
;; - M-x `crdt-visualize-author-mode' to color highlight text based on who
;; edited it (client-side).
;; - M-x `crdt-org-sync-overlay-mode' to toggle the syncing of folding/expanding
;; org-mode headings across peers (client-side).
;; - Read docs for more: sharing a REPL with different terminals, Tox/Teredo
;; proxy or SSH port forwarding to a VPS with a pubilc ip if host ip is not
;; public, and etc. (https://elpa.gnu.org/packages/crdt.html)
;;

(use-package crdt
  :config
  ;; protocol version must be the same on all peers
  (setq crdt-protocol-version "0.3.0")
  ;; enable to use TLS by default (kinda broken, dont recommend)
  (setq crdt-default-tls nil)
  ;; ---------------------------
  ;; To enable crdt-visualize-author-mode or crdt-org-sync-overlay-mode by
  ;;  default, uncomment:
  ;; (crdt-visualize-author-mode 1)
  ;; (crdt-org-sync-overlay-mode 1)
  ;; ---------------------------
  ;; Configure keybinds here:
  ;; (you can do almost everything from the .*-list-.* commands, 
  ;;  so just memorize those)
  (global-set-key 
   (kbd "C-c C") ; parent prefix key for below keybinds (pick something vacant)
   (let ((map (make-sparse-keymap)))
     (define-key map (kbd "S") #'crdt-share-buffer) ; start server
     ;; sessions
     (define-key map (kbd "s s") #'crdt-list-sessions) ; useful / press 'k'/'d' to remove
     (define-key map (kbd "s S") #'crdt-share-buffer)
     (define-key map (kbd "s X") #'crdt-stop-session)
     (define-key map (kbd "s d") #'crdt-disconnect)
     (define-key map (kbd "s k") #'crdt-disconnect)
     ;; buffers
     (define-key map (kbd "b b") #'crdt-list-buffers) ; useful
     (define-key map (kbd "b a") #'crdt-share-buffer)
     (define-key map (kbd "b o") #'crdt-switch-to-buffer)
     (define-key map (kbd "b d") #'crdt-stop-share-buffer)
     (define-key map (kbd "b k") #'crdt-stop-share-buffer)
     ;; users
     (define-key map (kbd "u u") #'crdt-list-users) ; useful / press 'f' to follow user
     (define-key map (kbd "u f") #'crdt-follow-user)
     (define-key map (kbd "u n") #'crdt-goto-next-user)
     (define-key map (kbd "u p") #'crdt-goto-prev-user)
     (define-key map (kbd "u g") #'crdt-goto-user)
     ;; misc
     (define-key map (kbd "m v") #'crdt-visualize-author-mode)
     (define-key map (kbd "m o") #'crdt-org-sync-overlay-mode)
     ;; return filled keymap
     map)))

(setup (:pkg pinentry)
  (:option epg-pinentry-mode 'loopback))

(use-package term
  :commands term
  :config
  (setq explicit-shell-file-name "bash") 
  (setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *"))

(use-package eterm-256color
  :hook (term-mode . eterm-256color-mode))
