dotfiles/emacs-old/.config/oldmacs.d/Emacs.org
** vterm

(depends on cmake, libtool-bin, and libvterm (and gcc-toolchain))

maybe try disabling evil in here? actually, it works in bash! but why no zsh?

#+begin_src emacs-lisp

  (defhydra ri/hydra-vterm-scale (:timeout 5)
    "scale text"
    ("+" text-scale-increase "in")
    ("-" text-scale-decrease "out")
    ("t" text-scale-increase "in")
    ("n" text-scale-decrease "out")
    ("=" text-scale-set "reset")
    ("g" nil "finished" :exit t))

  (setup (:pkg vterm)
    ;; :commands vterm
    (:with-map vterm-mode-map
      (:bind "C-," vterm-send-next-key
             "C-=" ri/hydra-vterm-scale/body
             "C--" text-scale-decrease
             "C-+" text-scale-increase))
    (:when-loaded
      ;; enter Meow insert mode automatically when open
      (when meow-global-mode
        (add-hook 'vterm-mode-hook (lambda ()
                                     (if meow-normal-mode
                                         (meow-insert-mode)))))
      ;; vv already set vv
      ;; (setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *")
      ;; (:when-loaded)
      (setq vterm-shell "bash")
      (setq vterm-buffer-name-string "vterm %s")
      (setq vterm-max-scrollback 10000)
      ;; Fixes vterm compilation on Guix System.
      ;; (https://www.reddit.com/r/GUIX/comments/11gzhyu/
      ;;  how_to_compile_the_vterm_module_from_emacs_and/)
      (defun ri/vterm-link-guix-library-on-compile (f &rest r)
        "Advice to replace compiling vterm with linking to just symlinking the guix library"
        (let ((guix-library "~/.guix-extra-profiles/emacs/emacs/lib/vterm-module.so"))
          (if (f-exists-p guix-library)
              (make-symbolic-link
               (expand-file-name "~/.guix-extra-profiles/emacs/emacs/lib/vterm-module.so")
               (file-name-directory (locate-library "vterm.el" t)) t)
            (message "DEBUG: vterm guix library %s doesn't exist, cant compile" guix-library))))
      (if ri/is-guix-system ; TODO: no need to do this shit :sob::sob::sob:
          (advice-add 'vterm-module-compile :around #'ri/vterm-link-guix-library-on-compile))))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  "emacs-vterm"
  "cmake"
  "make"
  "gcc-toolchain"
  "libvterm"
  "libtool"
  "perl"

#+end_src

** shell-mode

in between system shell and emacs...
- kinda broken
- can use evil editing
- counsel-shell-history

- M-p
- M-n

- not good, but works great on windows...

** TODO: Eshell

fix neofetch
+ C-r

#+begin_src emacs-lisp

  ;; eshell config
  (defun ri/configure-eshell ()
    ;; Save command history when commands are entered.
    ;;   Commands usually don't save until close, so if crashes, loses all progress.
    (add-hook 'eshell-pre-command-hook 'eshell-save-some-history)

    ;; Truncate buffer for performance
    (add-to-list 'eshell-output-filter-functions 'eshell-truncate-buffer)

    ;; Bind some useful keys for evil-mode
    (evil-define-key '(normal insert visual) eshell-mode-map (kbd "C-r") 'counsel-esh-history)
    ;; fixes the issue with cursor going to the beginning... fixed?
    (evil-define-key '(normal insert visual) eshell-mode-map (kbd "<home>") 'eshell-bol)
    (evil-normalize-keymaps)

    (setq eshell-history-size         10000
          eshell-buffer-maximum-lines 10000
          eshell-hist-ignoredups t
          eshell-scroll-to-bottom-on-input t))

  ;; themes
  (use-package eshell-git-prompt
    :after eshell)

  (use-package eshell
    :hook (eshell-first-time-mode . ri/configure-eshell)
    :config
    (with-eval-after-load 'esh-opt
      (setq eshell-destroy-buffer-when-process-dies t)
      (setq eshell-visual-commands '("htop" "zsh" "vim" "ssh")))

    (eshell-git-prompt-use-theme 'powerline))

#+end_src

** shell-pop (disabled)

*Note:* shell-pop has a bug that breaks org-babel-tangle, so instead use popper.el with multi-vterm.

Hit s-<return> to bring up scratchpad terminal.

https://github.com/kyagi/shell-pop-el

#+begin_src emacs-lisp :tangle no

  (use-package shell-pop
    :commands shell-pop
    :disabled
    :custom
    (shell-pop-universal-key nil)
    (shell-pop-default-directory "~")
    (shell-pop-shell-type (quote ("vterm" "*vterm*" (lambda nil (vterm shell-pop-term-shell)))))
    (shell-pop-term-shell "/bin/zsh")
    ;; (shell-pop-window-size 40)
    (shell-pop-window-size 40)
    (shell-pop-window-position "bottom"))

#+end_src

** multi-term (disabled)

You have to carefully consider which keys you want to pass to your multi-term shell and which you want to use to control Emacs. Pass over too few and you wont be able to control the program you want. Pass over the wrong ones and you wont be able to make use of emacs global commands. There is a simple mechanism to do this.
- =term-unbind-key-list= is a list of keys which emacs keeps for itself. By default it contains (C-z C-c C-x C-h C-y <ESC>)
- =term-bind-key-alist= is a list of keys and functions which you can use, for example to use Emacs style cursor movement to the multi-terminal. The default is long, so Ill let you look it up yourself.

#+begin_src emacs-lisp

  (use-package multi-term
    :disabled
    :config
    (setq multi-term-program "eshell"))

#+end_src

** TODO: multi-vterm

https://github.com/suonlight/multi-vterm

#+begin_src emacs-lisp

  (use-package multi-vterm
    :config
    ;; dedicated terminal height of 30%
    (setq multi-vterm-dedicated-window-height-percent 30))

#+end_src

** leader-keys

#+begin_src emacs-lisp

  (leader-key-def
    "at" 'vterm
    "aT" 'multi-vterm
    "am" '(:ignore t :which-key "multi-vterm-control")
    "amt" 'multi-vterm-project
    "amp" 'multi-vterm-prev
    "amn" 'multi-vterm-next
    "amm" 'multi-vterm-dedicated-toggle
    "ae" 'eshell)

#+end_src

* Files

file management, etc

#+begin_src emacs-lisp

  (leader-key-def
    "f"  '(:ignore t :which-key "files")
    "fr" '(counsel-recentf :which-key "recent files")
    "ff" '(find-file :which-key "find-file")
    "fp" '(lambda () (interactive)
            (find-file (expand-file-name "~/.dotfiles/.emacs.d/"))
            :which-key "open Emacs.org"))

#+end_src

