dotfiles/emacs-old/.config/oldmacs.d/init.el

(defhydra ri/hydra-vterm-scale (:timeout 5)
  "scale text"
  ("+" text-scale-increase "in")
  ("-" text-scale-decrease "out")
  ("t" text-scale-increase "in")
  ("n" text-scale-decrease "out")
  ("=" text-scale-set "reset")
  ("g" nil "finished" :exit t))

(setup (:pkg vterm)
  ;; :commands vterm
  (:with-map vterm-mode-map
    (:bind "C-," vterm-send-next-key
           "C-=" ri/hydra-vterm-scale/body
           "C--" text-scale-decrease
           "C-+" text-scale-increase))
  (:when-loaded
    ;; enter Meow insert mode automatically when open
    (when meow-global-mode
      (add-hook 'vterm-mode-hook (lambda ()
                                   (if meow-normal-mode
                                       (meow-insert-mode)))))
    ;; vv already set vv
    ;; (setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *")
    ;; (:when-loaded)
    (setq vterm-shell "bash")
    (setq vterm-buffer-name-string "vterm %s")
    (setq vterm-max-scrollback 10000)
    ;; Fixes vterm compilation on Guix System.
    ;; (https://www.reddit.com/r/GUIX/comments/11gzhyu/
    ;;  how_to_compile_the_vterm_module_from_emacs_and/)
    (defun ri/vterm-link-guix-library-on-compile (f &rest r)
      "Advice to replace compiling vterm with linking to just symlinking the guix library"
      (let ((guix-library "~/.guix-extra-profiles/emacs/emacs/lib/vterm-module.so"))
        (if (f-exists-p guix-library)
            (make-symbolic-link
             (expand-file-name "~/.guix-extra-profiles/emacs/emacs/lib/vterm-module.so")
             (file-name-directory (locate-library "vterm.el" t)) t)
          (message "DEBUG: vterm guix library %s doesn't exist, cant compile" guix-library))))
    (if ri/is-guix-system ; TODO: no need to do this shit :sob::sob::sob:
        (advice-add 'vterm-module-compile :around #'ri/vterm-link-guix-library-on-compile))))

;; eshell config
(defun ri/configure-eshell ()
  ;; Save command history when commands are entered.
  ;;   Commands usually don't save until close, so if crashes, loses all progress.
  (add-hook 'eshell-pre-command-hook 'eshell-save-some-history)

  ;; Truncate buffer for performance
  (add-to-list 'eshell-output-filter-functions 'eshell-truncate-buffer)

  ;; Bind some useful keys for evil-mode
  (evil-define-key '(normal insert visual) eshell-mode-map (kbd "C-r") 'counsel-esh-history)
  ;; fixes the issue with cursor going to the beginning... fixed?
  (evil-define-key '(normal insert visual) eshell-mode-map (kbd "<home>") 'eshell-bol)
  (evil-normalize-keymaps)

  (setq eshell-history-size         10000
        eshell-buffer-maximum-lines 10000
        eshell-hist-ignoredups t
        eshell-scroll-to-bottom-on-input t))

;; themes
(use-package eshell-git-prompt
  :after eshell)

(use-package eshell
  :hook (eshell-first-time-mode . ri/configure-eshell)
  :config
  (with-eval-after-load 'esh-opt
    (setq eshell-destroy-buffer-when-process-dies t)
    (setq eshell-visual-commands '("htop" "zsh" "vim" "ssh")))

  (eshell-git-prompt-use-theme 'powerline))

(use-package multi-term
  :disabled
  :config
  (setq multi-term-program "eshell"))

(use-package multi-vterm
  :config
  ;; dedicated terminal height of 30%
  (setq multi-vterm-dedicated-window-height-percent 30))

(leader-key-def
  "at" 'vterm
  "aT" 'multi-vterm
  "am" '(:ignore t :which-key "multi-vterm-control")
  "amt" 'multi-vterm-project
  "amp" 'multi-vterm-prev
  "amn" 'multi-vterm-next
  "amm" 'multi-vterm-dedicated-toggle
  "ae" 'eshell)

(leader-key-def
  "f"  '(:ignore t :which-key "files")
  "fr" '(counsel-recentf :which-key "recent files")
  "ff" '(find-file :which-key "find-file")
  "fp" '(lambda () (interactive)
          (find-file (expand-file-name "~/.dotfiles/.emacs.d/"))
          :which-key "open Emacs.org"))

;; dired
(use-package dired
