dotfiles/emacs-old/.config/oldmacs.d/Emacs.org
** TODO: Dired (copy table and hide dotfiles)

- Keybinds:
  |-----+------------+---+---------+----------------------+---+------+---------------------|
  |     | Marking    |   |         | Open/view/quit       |   |      | Copying/deleting/   |
  |     |            |   |         |                      |   |      | compressing         |
  |-----+------------+---+---------+----------------------+---+------+---------------------|
  | J   | search     |   | <ret>   | open file            |   | C    | copy file           |
  | m   | mark       |   | g o     | view file            |   | R    | rename/Move         |
  | %   | mark regex |   | S-<ret> | open in split window |   | % R  | rename regex        |
  | \*  | mark type  |   | M-<ret> | view file (scan)     |   | d/x  | delete selection    |
  | t   | inverts    |   | (    \) | hide info            |   | D    | delete/Trash file   |
  | u/U | unmark     |   | g r     | refresh dired        |   | Z    | compress/uncompress |
  | k/K | kill       |   | C-M-J   | ivy-immediate-done   |   | c    | compress advanced   |
  |     |            |   | H       | show/hide dots       |   |      | create empty file   |
  |     |            |   |         |                      |   |      |                     |
  |-----+------------+---+---------+----------------------+---+------+---------------------|
  |     |            |   |         |                      |   |      |                     |
  |-----+------------+---+---------+----------------------+---+------+---------------------|
  |     | Others     |   |         | Misc                 |   |      | Regex               |
  |-----+------------+---+---------+----------------------+---+------+---------------------|
  | T   | timestamp  |   | C-x C-q | Read only mode (ZZ)  |   | \&   | previous expression |
  | M   | -rw-r--r-- |   | &       | run program on file  |   | \1   |                     |
  | O   | owner      |   | I       | appends dired buffer |   | %s// |                     |
  | G   | group      |   |         |                      |   |      |                     |
  | S   | symlink    |   |         |                      |   |      |                     |
  | L   | load lisp  |   |         |                      |   |      |                     |
  |     |            |   |         |                      |   |      |                     |
  |-----+------------+---+---------+----------------------+---+------+---------------------|


#+begin_src emacs-lisp

  ;; dired
  (use-package dired
    :ensure nil ; make sure use-package doesn't try to install it.
    :straight nil
    :commands (dired dired-jump) ; defer loading of this config until a command is executed.
    :custom
    (dired-listing-switches "-agho --group-directories-first")
    (dired-dwim-target t) ; auto select dir to move to if another dired window open.
    (delete-by-moving-to-trash t)
    ;;(dired-compress-files-alist) ; add more file types to compression.
    :config
    (if ri/use-evil-mode
        (evil-collection-define-key 'normal 'dired-mode-map
                                  "h" 'dired-single-up-directory
                                  "l" 'dired-single-buffer
                                  "f" 'dired-create-empty-file)))
  ;;     ^ Might not work if using two dired windows! (dired-up-directory, dired-find-file)

  ;; HAS TO COME AFTER dired because using ":after dired".
  ;; Reuses the current Dired buffer to visit a directory without
  ;; creating a new buffer.
  (use-package dired-single
    :after dired)

  (defun ri/all-the-icons-dired-helper ()
    (if (equal dirvish-override-dired-mode nil)
        (all-the-icons-dired-mode)))

  (use-package all-the-icons-dired
    :hook (dired-mode . ri/all-the-icons-dired-helper))

  (use-package dired-open
    :commands (dired dired-jump)
    :config
    (setq dired-open-extensions
          '(("mkv" . "mpv")
            ;; ("pdf" . "docview")
            ("png" . "feh")
            ("docx" . "libreoffice"))))

  ;; ------------------------------

  (use-package dired-hide-dotfiles
    :after dired
    :config
    ;; special hack from ./lisp
    (require 'dired-hide-dotfiles-hack)
    ;; :config
    )

#+end_src

*Leader keys:*

#+begin_src emacs-lisp

  (leader-key-def
    "d"  '(:ignore t :which-key "dired")
    "dd" 'dired
    "dj" 'dired-jump
    "dh" 'ri/dired-hide-dotfiles-mode-toggle)

#+end_src

** dirvish

[[https://github.com/alexluigit/dirvish][Dirvish - Github]]

[[https://github.com/alexluigit/dirvish/blob/119f9f59a618bb7b476c93e9ab1d7542c5c1df41/docs/CUSTOMIZING.org#L350][Dirvish -- Customizing]]

To implement:
- add an emacs pdf viewer other than docview, but dont show immediately (only when Enter)

#+begin_src emacs-lisp

  (use-package dirvish
    :init (dirvish-override-dired-mode)
    :commands (dired dired-jump)
    :custom
    (dirvish-quick-access-entries ; It's a custom option, `setq' won't work
     '(("h" "~/"                          "Home")
       ("o" "~/Notes/org/"                "Org")
       ("s" "~/Notes/School/"             "School")
       ("c" "~/Notes/School/classes/current/"      "classes")
       ("C" "~/Code/"                     "Code")
       ("d" "~/Downloads/"                "Downloads")
       ("p" "~/Pictures/"                 "Pictures")
       ("e" "~/.dotfiles/.emacs.d/"       "Emacs user directory")
       ("g" "~/yui/guix"                  "Guix config")
       ("y" "~/yui/channel"               "Yumi channel")
       ("N" "~/.newmacs.d"                "Newmacs config")
       ("m" "/mnt/"                       "Drives")
       ("t" "~/.local/share/Trash/files/" "Trash")))
    :config
    ;; (define-key dirvish-mode-map (kbd "z") 'ri/dired-hide-dotfiles-mode--toggle)
    (setq dired-listing-switches
          ;; "-ahgo --group-directories-first"
          "-l --almost-all --human-readable --group-directories-first --no-group") ; AhoG
    (setq dired-dwim-target t) ; auto select dir to move to if another dired window open.
    (setq delete-by-moving-to-trash t)
    (dirvish-peek-mode)
    (setq dirvish-attributes
          '(all-the-icons file-time file-size collapse subtree-state vc-state git-msg))
    (setq dirvish-preview-dispatchers
          (cl-substitute 'pdf-preface 'pdf dirvish-preview-dispatchers))
    (setq dirvish-open-with-programs
          (let ((mpv (or (executable-find "mpv") "mpv")))
            `((,dirvish-audio-exts . (,mpv "--profile=builtin-pseudo-gui" "%f"))
              (,dirvish-video-exts . (,mpv "%f")))))
    :bind
    ("C-c d D" . dirvish)
    ("C-c d f" . dirvish-fd)
    ("C-c D" . dirvish-quick-access)
    ("C-c d a" . dirvish-quick-access)
    (:map dirvish-mode-map ; Dirvish inherits `dired-mode-map'
          ("h" . dired-up-directory)
          ("r" . dired-sort-toggle-or-edit)
          ("s" . dired-open-file)
          ("'" . ri/dired-hide-dotfiles-hack-toggle)
          (";" . dirvish)
          ("N" . dired-create-empty-file)
          ("M-T" . ri/dired-set-wallpaper)
          ("/" . dired-isearch-filenames-regexp)

          ("a"   . dirvish-quick-access)))

  ;; ("f"   . dirvish-file-info-menu)
  ;; ("y"   . dirvish-yank-menu)
  ;; ("N"   . dirvish-narrow)
  ;; ("^"   . dirvish-history-last)
  ;; ("h"   . dirvish-history-jump) ; remapped `describe-mode'
  ;; ("s"   . dirvish-quicksort)    ; remapped `dired-sort-toggle-or-edit'
  ;; ("v"   . dirvish-vc-menu)      ; remapped `dired-view-file'
  ;; ("TAB" . dirvish-subtree-toggle)
  ;; ("M-f" . dirvish-history-go-forward)
  ;; ("M-b" . dirvish-history-go-backward)
  ;; ("M-l" . dirvish-ls-switches-menu)
  ;; ("M-m" . dirvish-mark-menu)
  ;; ("M-t" . dirvish-layout-toggle)
  ;; ("M-s" . dirvish-setup-menu)
  ;; ("M-e" . dirvish-emerge-menu)
  ;; ("M-j" . dirvish-fd-jump)))

  (defun ri/dired-set-wallpaper ()
    (interactive)
    (let ((path (dired-get-filename)))
      (start-process-shell-command
       "feh dired" nil
       (concat "feh --bg-fill \"" path "\""))))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  "fd"

#+end_src

** TODO: open files externally (doesn't work with dirvish)

Doesnt work with Dirvish! must find workaround.

#+begin_src emacs-lisp

  (use-package openwith
    :config
    (setq openwith-associations
          (list
           (list (openwith-make-extension-regexp
                  '("mpg" "mpeg" "mp3" "mp4"
                    "avi" "wmv" "wav" "mov" "flv"
                    "ogm" "ogg" "mkv"))
                 "mpv"
                 '(file))
           (list (openwith-make-extension-regexp
                  '("xbm" "pbm" "pgm" "ppm" "pnm"
                    "png" "gif" "bmp" "tif" "jpeg")) ;; Removed jpg because Telega was
                 ;; causing feh to be opened...
                 "feh"
                 '(file))
           (list (openwith-make-extension-regexp
                  '("pdf"))
                 "mupdf"
                 '(file)))))

#+end_src

** TRAMP

#+begin_src emacs-lisp

  (setq tramp-default-method "ssh")
  (setq tramp-verbose 10)

#+end_src

** sudo-edit

#+begin_src emacs-lisp

  ;; doesn't work... what is tramp?
  (use-package sudo-edit
    :custom
    (sudo-edit-local-method "doas")
    :config
    (global-set-key (kbd "C-c C-r") 'sudo-edit))

#+end_src

** dired-toggle-sudo

#+begin_src emacs-lisp

  (use-package dired-toggle-sudo
    :commands (dired dired-jump)
    :bind
    (:map dired-mode-map
          ("C-c C-s" . dired-toggle-sudo)))

#+end_src

* Programs

