dotfiles/emacs-old/.config/oldmacs.d/Emacs.org
** elfeed

an rss feed reader for emacs

#+begin_src emacs-lisp

  ;; rss
  ;; maybe don't need, phone is enough?
  ;; maybe syncthing and import from database?
  ;; dont use commands elfeed, scan at startup?
  ;; expand upon this to make it usable (copy over old configs)
  (use-package elfeed
    :commands elfeed
    :config
    (setq elfeed-feeds
          '(
            "http://pragmaticemacs.com/feed/"
            "https://blog.privacyguides.org/feed_rss_created.xml"
            "https://www.cozynet.org/feed/feed.xml"
            )))

  (leader-key-def
    "ar" 'elfeed)

#+end_src

** Browser

*** browser to open with

#+begin_src emacs-lisp

  ;; (setq browse-url-browser-function 'browse-url-default-browser)
  (setq browse-url-browser-function 'w3m)

  (defun ri/browse-url-external-open (url)
    "Open the specified url in one of the following browsers:
  Librewolf, qutebrowser, firefox, etc..."
    (interactive "s")
    (message "DEBUG: the input: %s" url)
    (cond
     ((executable-find "qutebrowser")
      (call-process "qutebrowser" nil 0 nil url))
     ((executable-find "/usr/bin/librewolf")
      (call-process "/usr/bin/librewolf" nil 0 nil "--new-tab" url))
     (t
      (error "No usable browser found"))
     ))

  (defun ri/open-file-in-external-browser (&optional file-path)
    "Open the file in the current buffer, or FILE-PATH, in an external browser."
    (interactive)
    (ri/browse-url-external-open (browse-url-file-url (if file-path
                                                          file-path
                                                        (buffer-file-name)))))

#+end_src

*** eww

Consider emacs-w3m, where it's faster and better!

http://emacs-w3m.namazu.org/

#+begin_src emacs-lisp

  ;; eww is shite, also SPC and h trigger prefix. w3 browser?
  ;; disable cookies, or delete history after closing?
  ;; (setq browse-url-browser-function 'eww-browse-url)
  (use-package eww)

#+end_src

*** emacs-w3m

http://emacs-w3m.namazu.org/

#+begin_src emacs-lisp

  (use-package w3m
    :bind (:map w3m-mode-map
                ("F" . w3m-toggle-filtering)
                ("f" . w3m-scroll-up-or-next-url)))
  
#+end_src

*Guix packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

  "w3m"

#+end_src

** gnus

Usenet newsgroup reader

https://www.maketecheasier.com/emacs-usenet-reader-with-gnus/

Use "S-6" or "^" to enter server mode to browse newsgroups
"N" "P"
"RET" "M-RET"
"SPC" "DEL"
"n" "p"

#+begin_src emacs-lisp

  (use-package gnus
    :commands gnus
    :config
    (setq user-full-name '"aili")
    (setq user-mail-address '"yourname@email.invalid")
    (setq gnus-select-method '(nnnil))
    (setq gnus-secondary-select-methods '((nntp "news.gmane.io")
                                          ;(nntp "news.alt.religion.emacs")
                                          ;(nntp "gnu.emacs.sex")
                                        ))

    (setq gnus-directory (concat user-emacs-directory "News/")
          gnus-startup-file (concat user-emacs-directory "News/.newsrc")
          message-directory (concat user-emacs-directory "Mail/")))

  ;;(setq gnus-secondary-select-methods '((nntp "alt.religion.emacs")))

#+end_src

** mu4e

#+begin_src emacs-lisp :tangle

  ;; TODO: provide evil-mode alt (hard)

  (setup (:pkg mu4e)
    ;; defer for a while?

    ;; org-mode integration
    ;; (require 'org-mu4e)

    ;; Refresh mail using isync every 10 minutes
    (setq mu4e-update-interval (* 10 60))
    (setq mu4e-get-mail-command "mbsync -a")
    (setq mu4e-maildir "~/Mail/")

    ;; Use Ivy for mu4e completions (maildir folders, etc)
    ;; (setq mu4e-completing-read-function #'ivy-completing-read) ; dont need?

    ;; Make sure that moving a message (like to Trash) causes the
    ;; message to get a new file name.  This helps to avoid the
    ;; dreaded "UID is N beyond highest assigned" error.
    ;; See this link for more info: https://stackoverflow.com/a/43461973
    ;; NEED FOR mbsync !
    (setq mu4e-change-filenames-when-moving t)

    ;; multiple email accounts
    (setq mu4e-contexts
          `(,(make-mu4e-context
              :name "Mailbox"
              :match-func (lambda (msg)
                            (when msg
                              (string-prefix-p "/Mailbox" (mu4e-message-field msg :maildir))))
              :vars '((user-full-name . "senkowo")
                      (mu4e-sent-folder . "/Mailbox/Sent")
                      (mu4e-trash-folder . "/Mailbox/Trash")
                      (mu4e-drafts-folder . "/Mailbox/Drafts")
                      (mu4e-refile-folder . "/Mailbox/Archive")))))
    (setq mu4e-context-policy 'pick-first)

    ;; shortcuts
    (setq mu4e-maildir-shortcuts
          '(("/Mailbox/INBOX" . ?i)
            ("/Mailbox/sent" . ?s)))

    )

#+end_src

** ement

a matrix client for emacs
https://github.com/alphapapa/ement.el

#+begin_src emacs-lisp

  ;; matrix client
  (use-package ement
    :commands ement)

#+end_src

** emacs-jabber

An XMPP client for Emacs.
https://codeberg.org/emacs-jabber/emacs-jabber/

#+begin_src emacs-lisp

  (use-package jabber
    :commands jabber)

#+end_src

** erc

an irc client for emacs
- Good servers: ##furry #transchat-social #emacs #guix ##programming ##philosophy ##rust ##trans (wiki/trivias? sounds fun)
|-------------------+------------------+------------+-------------|
| Good servers      |                  |            |             |
|-------------------+------------------+------------+-------------|
| ##furry           | ##programming    | #guile     | #blahaj     |
| #transchat-social | ##philosophy     | #lisp      | #Jobs       |
| #emacs            | ##rust           | #libera    | #hackers    |
| #guix             | #emacsconf       | #libreboot | (trivias?)  |
| ##trans           | #gentoo          | #linux     | #inkscape   |
|                   | #emacs-beginners | #monero    | #nonguix    |
| [ 75% ]           |                  | #scheme    | #org-mode   |
|                   |                  |            | #philosophy |


|-----------------------+------------+-----------|
| list of erc commands: |            |           |
|-----------------------+------------+-----------|
| erc-tls               | irc client | SPC k o i |
| erc : /list           |            |           |
| erc : /join           |            |           |
| erc : /topic          |            |           |
| erc : /leave          |            |           |
| erc : /part (leave)   |            |           |
| erc : /quit           |            |           |
| erc : /reconnect      |            |           |
|-----------------------+------------+-----------|

#+begin_src emacs-lisp

  ;; erc
  ;; make erc start after startup?
  (use-package erc
    :config
    (setq erc-prompt (lambda () (concat "[" (buffer-name) "]"))
          erc-server "irc.libera.chat"
          erc-nick "senko"
          erc-user-full-name "artemis"
          ;; erc-autojoin-channels-alist '(("irc.libera.chat" "#emacs" "#linux"))
          ;; By default, ERC selects the channel buffers when it reconnects. If you'd like it to connect to channels in the background, use this:
          erc-auto-query 'bury
          erc-kill-buffer-on-part t ; if nil, will reuse buffers if rejoin.
          erc-fill-static-center 27 ; def: 27
          ;; erc-fill-function 'erc-fill-static ; def: erc-fill-variable
          erc-fill-function 'erc-fill-variable ; the def ^^^
          erc-fill-column 80 ; def: 78
          ))

  (leader-key-def
    "ai" 'erc-ssl)

#+end_src

** mastodon.el

A mastodon/fediverse client for Emacs.
https://codeberg.org/martianh/mastodon.el

#+begin_src emacs-lisp

  (use-package mastodon
    :commands mastodon)

#+end_src

* DVORAK swap x and u

#+begin_src emacs-lisp

  ;; org binding on M-t so make all t key bindings translate to p ?

  ;; swap ctrl and alt keys, since it's easier to press ctrl with the thumb

  (global-set-key (kbd "C-t") 'previous-line)
  ;; make C-h 'prev-line instead? (make sure to git commit pull and push before, and
  ;;  don't push for a while. So to revert, simply revert to remote origin main head).
  ;;  (maybe create a variable and if true change certain keybinds for modes?
  ;; One issue with swapping is that C-f C-b C-h C-n becomes harder to do and possibly,
  ;;  /possibly/ harder to do.

  (global-set-key (kbd "C-u") ctl-x-map)
  ;; (global-set-key (kbd "C-z") 'universal-argument)
  ;; (global-set-key (kbd "C-z") help-map)
  (global-set-key (kbd "M--") 'universal-argument)
  ;; (global-set-key (kbd "C-M-g") 'universal-argument)

  ;; what if i bind "C-c z" to help-map so that i can do "SPC z" in meow-leader-mode-map to
  ;;  access "C-z" options? Should work...

#+end_src

* Runtime performance

#+begin_src emacs-lisp

  ;; ;; make gc pauses faster by decreaseing the threshold.
  ;; (setq gc-cons-threshold (* 2 1000 1000))

#+end_src

* Emacs profile

#+begin_src scheme :tangle ../.config/guix/manifests/emacs.scm :noweb yes
  
  (specifications->manifest
   '("emacs"
     <<packages>>
     ))

#+end_src

