dotfiles/emacs-old/.config/oldmacs.d/init.el
;; maybe don't need, phone is enough?
;; maybe syncthing and import from database?
;; dont use commands elfeed, scan at startup?
;; expand upon this to make it usable (copy over old configs)
(use-package elfeed
  :commands elfeed
  :config
  (setq elfeed-feeds
        '(
          "http://pragmaticemacs.com/feed/"
          "https://blog.privacyguides.org/feed_rss_created.xml"
          "https://www.cozynet.org/feed/feed.xml"
          )))

(leader-key-def
  "ar" 'elfeed)

;; (setq browse-url-browser-function 'browse-url-default-browser)
(setq browse-url-browser-function 'w3m)

(defun ri/browse-url-external-open (url)
  "Open the specified url in one of the following browsers:
Librewolf, qutebrowser, firefox, etc..."
  (interactive "s")
  (message "DEBUG: the input: %s" url)
  (cond
   ((executable-find "qutebrowser")
    (call-process "qutebrowser" nil 0 nil url))
   ((executable-find "/usr/bin/librewolf")
    (call-process "/usr/bin/librewolf" nil 0 nil "--new-tab" url))
   (t
    (error "No usable browser found"))
   ))

(defun ri/open-file-in-external-browser (&optional file-path)
  "Open the file in the current buffer, or FILE-PATH, in an external browser."
  (interactive)
  (ri/browse-url-external-open (browse-url-file-url (if file-path
                                                        file-path
                                                      (buffer-file-name)))))

;; eww is shite, also SPC and h trigger prefix. w3 browser?
;; disable cookies, or delete history after closing?
;; (setq browse-url-browser-function 'eww-browse-url)
(use-package eww)

(use-package w3m
  :bind (:map w3m-mode-map
              ("F" . w3m-toggle-filtering)
              ("f" . w3m-scroll-up-or-next-url)))

(use-package gnus
  :commands gnus
  :config
  (setq user-full-name '"aili")
  (setq user-mail-address '"yourname@email.invalid")
  (setq gnus-select-method '(nnnil))
  (setq gnus-secondary-select-methods '((nntp "news.gmane.io")
                                        ;(nntp "news.alt.religion.emacs")
                                        ;(nntp "gnu.emacs.sex")
                                      ))

  (setq gnus-directory (concat user-emacs-directory "News/")
        gnus-startup-file (concat user-emacs-directory "News/.newsrc")
        message-directory (concat user-emacs-directory "Mail/")))

;;(setq gnus-secondary-select-methods '((nntp "alt.religion.emacs")))

;; matrix client
(use-package ement
  :commands ement)

(use-package jabber
  :commands jabber)

;; erc
;; make erc start after startup?
(use-package erc
  :config
  (setq erc-prompt (lambda () (concat "[" (buffer-name) "]"))
        erc-server "irc.libera.chat"
        erc-nick "senko"
        erc-user-full-name "artemis"
        ;; erc-autojoin-channels-alist '(("irc.libera.chat" "#emacs" "#linux"))
        ;; By default, ERC selects the channel buffers when it reconnects. If you'd like it to connect to channels in the background, use this:
        erc-auto-query 'bury
        erc-kill-buffer-on-part t ; if nil, will reuse buffers if rejoin.
        erc-fill-static-center 27 ; def: 27
        ;; erc-fill-function 'erc-fill-static ; def: erc-fill-variable
        erc-fill-function 'erc-fill-variable ; the def ^^^
        erc-fill-column 80 ; def: 78
        ))

(leader-key-def
  "ai" 'erc-ssl)

(use-package mastodon
  :commands mastodon)

;; org binding on M-t so make all t key bindings translate to p ?

;; swap ctrl and alt keys, since it's easier to press ctrl with the thumb

(global-set-key (kbd "C-t") 'previous-line)
;; make C-h 'prev-line instead? (make sure to git commit pull and push before, and
;;  don't push for a while. So to revert, simply revert to remote origin main head).
;;  (maybe create a variable and if true change certain keybinds for modes?
;; One issue with swapping is that C-f C-b C-h C-n becomes harder to do and possibly,
;;  /possibly/ harder to do.

(global-set-key (kbd "C-u") ctl-x-map)
;; (global-set-key (kbd "C-z") 'universal-argument)
;; (global-set-key (kbd "C-z") help-map)
(global-set-key (kbd "M--") 'universal-argument)
;; (global-set-key (kbd "C-M-g") 'universal-argument)

;; what if i bind "C-c z" to help-map so that i can do "SPC z" in meow-leader-mode-map to
;;  access "C-z" options? Should work...

;; ;; make gc pauses faster by decreaseing the threshold.
;; (setq gc-cons-threshold (* 2 1000 1000))
